#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_R2T1LingyangMd10011_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_R2T1LingyangMd10011_PC.ABP_R2T1LingyangMd10011_PC_C
// 0x20B0 (0x2430 - 0x0380)
class UABP_R2T1LingyangMd10011_PC_C final : public UAnimInstance
{
public:
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0388(0x0038)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03C0(0x0138)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x04F8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0518(0x0020)()
	uint8                                         Pad_538[0x8];                                      // 0x0538(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_11;               // 0x0540(0x0270)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_10;               // 0x07B0(0x0270)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_9;                // 0x0A20(0x0270)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_8;                // 0x0C90(0x0270)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_7;                // 0x0F00(0x0270)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_6;                // 0x1170(0x0270)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_5;                // 0x13E0(0x0270)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_4;                // 0x1650(0x0270)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_3;                // 0x18C0(0x0270)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_2;                // 0x1B30(0x0270)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup_1;                // 0x1DA0(0x0270)()
	struct FAnimNode_KawaiiPhysicsGroup           AnimGraphNode_KawaiiPhysicsGroup;                  // 0x2010(0x0270)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2280(0x0038)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x22B8(0x00A8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x2360(0x00C0)()
	bool                                          PhysicsClothSimulateEnable;                        // 0x2420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2421[0x3];                                     // 0x2421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PhysicsClothSimulateScale;                         // 0x2424(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_R2T1LingyangMd10011_PC(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void UpdatePhysicsClothSimulateEnable(float DeltaTIme);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void PhyCloth(const struct FPoseLink& InPose, struct FPoseLink* Param_PhyCloth);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_R2T1LingyangMd10011_PC_C">();
	}
	static class UABP_R2T1LingyangMd10011_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_R2T1LingyangMd10011_PC_C>();
	}
};
static_assert(alignof(UABP_R2T1LingyangMd10011_PC_C) == 0x000010, "Wrong alignment on UABP_R2T1LingyangMd10011_PC_C");
static_assert(sizeof(UABP_R2T1LingyangMd10011_PC_C) == 0x002430, "Wrong size on UABP_R2T1LingyangMd10011_PC_C");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, UberGraphFrame) == 0x000380, "Member 'UABP_R2T1LingyangMd10011_PC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_Root_1) == 0x000388, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_LinkedInputPose) == 0x0003C0, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_LocalToComponentSpace) == 0x0004F8, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_ComponentToLocalSpace) == 0x000518, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_11) == 0x000540, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_11' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_10) == 0x0007B0, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_10' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_9) == 0x000A20, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_9' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_8) == 0x000C90, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_8' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_7) == 0x000F00, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_7' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_6) == 0x001170, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_6' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_5) == 0x0013E0, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_5' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_4) == 0x001650, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_4' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_3) == 0x0018C0, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_3' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_2) == 0x001B30, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_2' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup_1) == 0x001DA0, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup_1' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_KawaiiPhysicsGroup) == 0x002010, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_KawaiiPhysicsGroup' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_Root) == 0x002280, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_LinkedAnimGraph) == 0x0022B8, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_LinkedAnimGraph' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, AnimGraphNode_LinkedAnimLayer) == 0x002360, "Member 'UABP_R2T1LingyangMd10011_PC_C::AnimGraphNode_LinkedAnimLayer' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, PhysicsClothSimulateEnable) == 0x002420, "Member 'UABP_R2T1LingyangMd10011_PC_C::PhysicsClothSimulateEnable' has a wrong offset!");
static_assert(offsetof(UABP_R2T1LingyangMd10011_PC_C, PhysicsClothSimulateScale) == 0x002424, "Member 'UABP_R2T1LingyangMd10011_PC_C::PhysicsClothSimulateScale' has a wrong offset!");

}

