#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ELingyangLionHeadMd10011_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_ELingyangLionHeadMd10011_PC.ABP_ELingyangLionHeadMd10011_PC_C.ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC
// 0x00B0 (0x00B0 - 0x0000)
struct ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_3;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_4;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_5;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_6;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_7;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_8;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_9;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_10;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_11;         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_12;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_13;         // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_11;       // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_12;       // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_13;       // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_14;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_14;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_15;       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_16;       // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_15;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_17;       // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_18;       // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_19;       // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_16;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_20;       // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_17;         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_18;         // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_19;         // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_21;       // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_22;       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46[0x2];                                       // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AddMaterialControllerData_ReturnValue;    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_20;         // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0070(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_SpawnEffect_ReturnValue;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsTag_ReturnValue_1;                // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC) == 0x000010, "Wrong alignment on ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC");
static_assert(sizeof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC) == 0x0000B0, "Wrong size on ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, EntryPoint) == 0x000000, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000004, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000005, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000006, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_3) == 0x000007, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_4) == 0x000008, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_5) == 0x000009, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_6) == 0x00000A, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_7) == 0x00000B, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_8) == 0x00000C, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_9) == 0x00000D, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000E, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000F, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_10) == 0x000010, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000011, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000012, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000013, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_11) == 0x000014, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000015, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000016, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x000017, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_12) == 0x000018, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x000019, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x00001A, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_10) == 0x00001B, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_13) == 0x00001C, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_11) == 0x00001D, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_12) == 0x00001E, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_13) == 0x00001F, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_14) == 0x000020, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_14) == 0x000021, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_15) == 0x000022, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_16) == 0x000023, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_15) == 0x000024, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_17) == 0x000025, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_18) == 0x000026, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_19) == 0x000027, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_16) == 0x000028, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_BooleanOR_ReturnValue) == 0x000029, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_20) == 0x00002A, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_BooleanOR_ReturnValue_1) == 0x00002B, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_17) == 0x00002C, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_18) == 0x00002D, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_19) == 0x00002E, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_21) == 0x00002F, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_EqualEqual_ByteByte_ReturnValue_22) == 0x000030, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_EqualEqual_ByteByte_ReturnValue_22' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000038, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, K2Node_Event_DeltaTimeX) == 0x000040, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_IsValid_ReturnValue) == 0x000044, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_IsValid_ReturnValue_1) == 0x000045, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_GetPathName_ReturnValue) == 0x000048, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_GetCurveValue_ReturnValue) == 0x000058, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_IsValid_ReturnValue_2) == 0x00005C, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00005D, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_BooleanAND_ReturnValue) == 0x00005E, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_AddMaterialControllerData_ReturnValue) == 0x000060, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_AddMaterialControllerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_IsValid_ReturnValue_3) == 0x000064, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_BooleanAND_ReturnValue_1) == 0x000065, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_NotEqual_ByteByte_ReturnValue_20) == 0x000066, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_NotEqual_ByteByte_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_BooleanAND_ReturnValue_2) == 0x000067, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_BooleanAND_ReturnValue_3) == 0x000068, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000070, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_SpawnEffect_ReturnValue) == 0x0000A0, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_SpawnEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_ContainsTag_ReturnValue) == 0x0000A4, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC, CallFunc_ContainsTag_ReturnValue_1) == 0x0000A5, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_ExecuteUbergraph_ABP_ELingyangLionHeadMd10011_PC::CallFunc_ContainsTag_ReturnValue_1' has a wrong offset!");

// Function ABP_ELingyangLionHeadMd10011_PC.ABP_ELingyangLionHeadMd10011_PC_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_ELingyangLionHeadMd10011_PC_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ELingyangLionHeadMd10011_PC_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on ABP_ELingyangLionHeadMd10011_PC_C_BlueprintUpdateAnimation");
static_assert(sizeof(ABP_ELingyangLionHeadMd10011_PC_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on ABP_ELingyangLionHeadMd10011_PC_C_BlueprintUpdateAnimation");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function ABP_ELingyangLionHeadMd10011_PC.ABP_ELingyangLionHeadMd10011_PC_C.Ë
// 0x0040 (0x0040 - 0x0000)
struct ABP_ELingyangLionHeadMd10011_PC_C____ final
{
public:
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_GetComponentsByTag_ReturnValue;           // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_ELingyangLionHeadMd10011_PC_C____) == 0x000008, "Wrong alignment on ABP_ELingyangLionHeadMd10011_PC_C____");
static_assert(sizeof(ABP_ELingyangLionHeadMd10011_PC_C____) == 0x000040, "Wrong size on ABP_ELingyangLionHeadMd10011_PC_C____");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C____, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000000, "Member 'ABP_ELingyangLionHeadMd10011_PC_C____::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C____, K2Node_DynamicCast_AsTs_Base_Character) == 0x000008, "Member 'ABP_ELingyangLionHeadMd10011_PC_C____::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C____, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'ABP_ELingyangLionHeadMd10011_PC_C____::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C____, CallFunc_GetComponentsByTag_ReturnValue) == 0x000018, "Member 'ABP_ELingyangLionHeadMd10011_PC_C____::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C____, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000028, "Member 'ABP_ELingyangLionHeadMd10011_PC_C____::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C____, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'ABP_ELingyangLionHeadMd10011_PC_C____::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C____, CallFunc_GetAnimInstance_ReturnValue) == 0x000030, "Member 'ABP_ELingyangLionHeadMd10011_PC_C____::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C____, CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue) == 0x000038, "Member 'ABP_ELingyangLionHeadMd10011_PC_C____::CallFunc_GetLinkedAnimGraphInstanceByTag_ReturnValue' has a wrong offset!");

// Function ABP_ELingyangLionHeadMd10011_PC.ABP_ELingyangLionHeadMd10011_PC_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_ELingyangLionHeadMd10011_PC_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_ELingyangLionHeadMd10011_PC_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_ELingyangLionHeadMd10011_PC_C_AnimGraph");
static_assert(sizeof(ABP_ELingyangLionHeadMd10011_PC_C_AnimGraph) == 0x000010, "Wrong size on ABP_ELingyangLionHeadMd10011_PC_C_AnimGraph");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function ABP_ELingyangLionHeadMd10011_PC.ABP_ELingyangLionHeadMd10011_PC_C.PhyCloth
// 0x0020 (0x0020 - 0x0000)
struct ABP_ELingyangLionHeadMd10011_PC_C_PhyCloth final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Param_PhyCloth;                                    // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_ELingyangLionHeadMd10011_PC_C_PhyCloth) == 0x000008, "Wrong alignment on ABP_ELingyangLionHeadMd10011_PC_C_PhyCloth");
static_assert(sizeof(ABP_ELingyangLionHeadMd10011_PC_C_PhyCloth) == 0x000020, "Wrong size on ABP_ELingyangLionHeadMd10011_PC_C_PhyCloth");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_PhyCloth, InPose) == 0x000000, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_PhyCloth::InPose' has a wrong offset!");
static_assert(offsetof(ABP_ELingyangLionHeadMd10011_PC_C_PhyCloth, Param_PhyCloth) == 0x000010, "Member 'ABP_ELingyangLionHeadMd10011_PC_C_PhyCloth::Param_PhyCloth' has a wrong offset!");

}

