#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_LiufangzheCommon

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "KuroAnim_structs.hpp"
#include "ELiufangzheWeaponType_structs.hpp"
#include "ABP_MonsterCommon_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_LiufangzheCommon.ABP_LiufangzheCommon_C
// 0x5600 (0x9B00 - 0x4500)
class UABP_LiufangzheCommon_C : public UABP_MonsterCommon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_ABP_LiufangzheCommon_C;             // 0x4500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1_ABP_LiufangzheCommon_C;       // 0x4508(0x0038)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_ABP_LiufangzheCommon_C; // 0x4540(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_ABP_LiufangzheCommon_C; // 0x4560(0x0020)()
	struct FAnimNode_Feedback                     AnimGraphNode_Feedback_ABP_LiufangzheCommon_C;     // 0x4580(0x0260)()
	struct FAnimNode_SightLock                    AnimGraphNode_SightLock_ABP_LiufangzheCommon_C;    // 0x47E0(0x01B8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_ABP_LiufangzheCommon_C; // 0x4998(0x0138)()
	struct FAnimNode_BoneRotateToLocation         AnimGraphNode_BoneRotateToLocation_ABP_LiufangzheCommon_C; // 0x4AD0(0x0120)()
	struct FAnimNode_Root                         AnimGraphNode_Root_ABP_LiufangzheCommon_C;         // 0x4BF0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44_ABP_LiufangzheCommon_C; // 0x4C28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43_ABP_LiufangzheCommon_C; // 0x4C50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42_ABP_LiufangzheCommon_C; // 0x4C78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41_ABP_LiufangzheCommon_C; // 0x4CA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40_ABP_LiufangzheCommon_C; // 0x4CC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39_ABP_LiufangzheCommon_C; // 0x4CF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x4D18(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22_ABP_LiufangzheCommon_C; // 0x4D48(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67;                   // 0x4D80(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_66;                   // 0x4E10(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65;                   // 0x4EA0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64;                   // 0x4F30(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63;                   // 0x4FC0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_62;                   // 0x5050(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_7;                    // 0x50E0(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21_ABP_LiufangzheCommon_C; // 0x5190(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3_ABP_LiufangzheCommon_C; // 0x51C8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20_ABP_LiufangzheCommon_C; // 0x51F8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x5230(0x0148)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38_ABP_LiufangzheCommon_C; // 0x5378(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37_ABP_LiufangzheCommon_C; // 0x53A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36_ABP_LiufangzheCommon_C; // 0x53C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35_ABP_LiufangzheCommon_C; // 0x53F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34_ABP_LiufangzheCommon_C; // 0x5418(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33_ABP_LiufangzheCommon_C; // 0x5440(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32_ABP_LiufangzheCommon_C; // 0x5468(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31_ABP_LiufangzheCommon_C; // 0x5490(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30_ABP_LiufangzheCommon_C; // 0x54B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29_ABP_LiufangzheCommon_C; // 0x54E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28_ABP_LiufangzheCommon_C; // 0x5508(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_61;                   // 0x5530(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60;                   // 0x55C0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x5650(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x56E0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x5770(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x5800(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_6;                    // 0x5890(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19_ABP_LiufangzheCommon_C; // 0x5940(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x5978(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x5A08(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x5A98(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x5B28(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0x5BB8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0x5C48(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_5;                    // 0x5CD8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18_ABP_LiufangzheCommon_C; // 0x5D88(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0x5DC0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0x5E50(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0x5EE0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0x5F70(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0x6000(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0x6090(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_4;                    // 0x6120(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17_ABP_LiufangzheCommon_C; // 0x61D0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0x6208(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0x6298(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0x6328(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0x63B8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0x6448(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0x64D8(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_3;                    // 0x6568(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16_ABP_LiufangzheCommon_C; // 0x6618(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2_ABP_LiufangzheCommon_C; // 0x6650(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15_ABP_LiufangzheCommon_C; // 0x6680(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4_ABP_LiufangzheCommon_C; // 0x66B8(0x0148)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x6800(0x01B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3_ABP_LiufangzheCommon_C; // 0x69B0(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27_ABP_LiufangzheCommon_C; // 0x6B60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26_ABP_LiufangzheCommon_C; // 0x6B88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25_ABP_LiufangzheCommon_C; // 0x6BB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24_ABP_LiufangzheCommon_C; // 0x6BD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23_ABP_LiufangzheCommon_C; // 0x6C00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22_ABP_LiufangzheCommon_C; // 0x6C28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21_ABP_LiufangzheCommon_C; // 0x6C50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20_ABP_LiufangzheCommon_C; // 0x6C78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19_ABP_LiufangzheCommon_C; // 0x6CA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18_ABP_LiufangzheCommon_C; // 0x6CC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17_ABP_LiufangzheCommon_C; // 0x6CF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16_ABP_LiufangzheCommon_C; // 0x6D18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15_ABP_LiufangzheCommon_C; // 0x6D40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14_ABP_LiufangzheCommon_C; // 0x6D68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13_ABP_LiufangzheCommon_C; // 0x6D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12_ABP_LiufangzheCommon_C; // 0x6DB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11_ABP_LiufangzheCommon_C; // 0x6DE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10_ABP_LiufangzheCommon_C; // 0x6E08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9_ABP_LiufangzheCommon_C; // 0x6E30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8_ABP_LiufangzheCommon_C; // 0x6E58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7_ABP_LiufangzheCommon_C; // 0x6E80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6_ABP_LiufangzheCommon_C; // 0x6EA8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_37_ABP_LiufangzheCommon_C; // 0x6ED0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36_ABP_LiufangzheCommon_C; // 0x6F60(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_35_ABP_LiufangzheCommon_C; // 0x6FF0(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_3_ABP_LiufangzheCommon_C; // 0x7080(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14_ABP_LiufangzheCommon_C; // 0x7140(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5_ABP_LiufangzheCommon_C; // 0x7178(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13_ABP_LiufangzheCommon_C; // 0x71A0(0x0038)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12_ABP_LiufangzheCommon_C; // 0x71D8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_34_ABP_LiufangzheCommon_C; // 0x7210(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11_ABP_LiufangzheCommon_C; // 0x72A0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_33_ABP_LiufangzheCommon_C; // 0x72D8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10_ABP_LiufangzheCommon_C; // 0x7368(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_32_ABP_LiufangzheCommon_C; // 0x73A0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_31_ABP_LiufangzheCommon_C; // 0x7430(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30_ABP_LiufangzheCommon_C; // 0x74C0(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2_ABP_LiufangzheCommon_C; // 0x7550(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9_ABP_LiufangzheCommon_C; // 0x7610(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_29_ABP_LiufangzheCommon_C; // 0x7648(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_28_ABP_LiufangzheCommon_C; // 0x76D8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_27_ABP_LiufangzheCommon_C; // 0x7768(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1_ABP_LiufangzheCommon_C; // 0x77F8(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8_ABP_LiufangzheCommon_C; // 0x78B8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4_ABP_LiufangzheCommon_C; // 0x78F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_26_ABP_LiufangzheCommon_C; // 0x7918(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_25_ABP_LiufangzheCommon_C; // 0x79A8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_24_ABP_LiufangzheCommon_C; // 0x7A38(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_23_ABP_LiufangzheCommon_C; // 0x7AC8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_22_ABP_LiufangzheCommon_C; // 0x7B58(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_21_ABP_LiufangzheCommon_C; // 0x7BE8(0x0090)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_ABP_LiufangzheCommon_C; // 0x7C78(0x00C0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7_ABP_LiufangzheCommon_C; // 0x7D38(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1_ABP_LiufangzheCommon_C; // 0x7D70(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6_ABP_LiufangzheCommon_C; // 0x7DA0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3_ABP_LiufangzheCommon_C; // 0x7DD8(0x0148)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_20_ABP_LiufangzheCommon_C; // 0x7F20(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_19_ABP_LiufangzheCommon_C; // 0x7FB0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_18_ABP_LiufangzheCommon_C; // 0x8040(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17_ABP_LiufangzheCommon_C; // 0x80D0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_16_ABP_LiufangzheCommon_C; // 0x8160(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15_ABP_LiufangzheCommon_C; // 0x81F0(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0x8280(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5_ABP_LiufangzheCommon_C; // 0x8330(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14_ABP_LiufangzheCommon_C; // 0x8368(0x0090)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x83F8(0x00D0)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x84C8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13_ABP_LiufangzheCommon_C; // 0x8500(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12_ABP_LiufangzheCommon_C; // 0x8590(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11_ABP_LiufangzheCommon_C; // 0x8620(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10_ABP_LiufangzheCommon_C; // 0x86B0(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9_ABP_LiufangzheCommon_C; // 0x8740(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8_ABP_LiufangzheCommon_C; // 0x87D0(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_1;                    // 0x8860(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4_ABP_LiufangzheCommon_C; // 0x8910(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2_ABP_LiufangzheCommon_C; // 0x8948(0x0148)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2_ABP_LiufangzheCommon_C; // 0x8A90(0x01B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2_ABP_LiufangzheCommon_C;       // 0x8C40(0x0060)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_ABP_LiufangzheCommon_C; // 0x8CA0(0x00C0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1_ABP_LiufangzheCommon_C;       // 0x8D60(0x0060)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1_ABP_LiufangzheCommon_C; // 0x8DC0(0x01B0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3_ABP_LiufangzheCommon_C; // 0x8F70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2_ABP_LiufangzheCommon_C; // 0x8F98(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_ABP_LiufangzheCommon_C;         // 0x8FC0(0x0060)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7_ABP_LiufangzheCommon_C; // 0x9020(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3_ABP_LiufangzheCommon_C; // 0x90B0(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_ABP_LiufangzheCommon_C; // 0x90E8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2_ABP_LiufangzheCommon_C; // 0x9118(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1_ABP_LiufangzheCommon_C; // 0x9150(0x0148)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1_ABP_LiufangzheCommon_C; // 0x9298(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ABP_LiufangzheCommon_C; // 0x92C0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6_ABP_LiufangzheCommon_C; // 0x92E8(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5_ABP_LiufangzheCommon_C; // 0x9378(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4_ABP_LiufangzheCommon_C; // 0x9408(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3_ABP_LiufangzheCommon_C; // 0x9498(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2_ABP_LiufangzheCommon_C; // 0x9528(0x0090)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1_ABP_LiufangzheCommon_C; // 0x95B8(0x0090)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt;                      // 0x9648(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1_ABP_LiufangzheCommon_C; // 0x96F8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_ABP_LiufangzheCommon_C; // 0x9730(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_ABP_LiufangzheCommon_C;  // 0x97C0(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_ABP_LiufangzheCommon_C; // 0x97F8(0x0148)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_ABP_LiufangzheCommon_C; // 0x9940(0x01B0)()
	bool                                          ___0;                                              // 0x9AF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          _kh_0;                                             // 0x9AF1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          _0;                                                // 0x9AF2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Five__0;                                           // 0x9AF3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ____0;                                             // 0x9AF4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ELiufangzheWeaponType                         Fh__;                                              // 0x9AF5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          A__7;                                              // 0x9AF6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          A__s;                                              // 0x9AF7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_LiufangzheCommon(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_TransitionResult_52C450844EBF9BFBB8282B9C6B941D1D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_TransitionResult_C823D0574DC7BFFD1486B185FB74217D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_TransitionResult_8E52222C4F7CCA4D8A2BD6955D653104();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_LiufangzheCommon_AnimGraphNode_BlendListByInt_0E3C99E146C38005332675958239B31D();
