#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_KnucklesCommonL

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EWeaponViewName_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_KnucklesCommonL.ABP_KnucklesCommonL_C
// 0x15A0 (0x1920 - 0x0380)
class UABP_KnucklesCommonL_C final : public UAnimInstance
{
public:
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x03C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x03E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x0410(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x0438(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x0460(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x0488(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x04B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x04D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x0500(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x0528(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x0550(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0578(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x05A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x05C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x05F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_15;                   // 0x0618(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x06A8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x06E0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x0770(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x07A8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x0838(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0870(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x0900(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0938(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x09C8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0A00(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x0A90(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0AC8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x0B58(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0B90(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x0C20(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x0C58(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x0DA0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x0DD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x0E00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0E28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0E50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0E78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0EA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0EC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0EF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0F18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0F40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0F68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0F90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0FB8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0FE0(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1070(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x10A8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x1138(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x1170(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1200(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1238(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x12C8(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1300(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1390(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x13C8(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x1458(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1490(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1520(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1558(0x0090)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x15E8(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1620(0x0148)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1768(0x0038)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x17A0(0x0148)()
	class ATsBaseCharacter_C*                     _r__;                                              // 0x18E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta_Time;                                        // 0x18F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WeaponOpen;                                        // 0x18F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18F5[0x3];                                     // 0x18F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Open_Delay;                                        // 0x18F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __s_fh;                                            // 0x18FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Fh___;                                             // 0x18FD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsUI;                                              // 0x18FE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18FF[0x1];                                     // 0x18FF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Fh_4I_;                                            // 0x1900(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SMfh_4I_;                                          // 0x1904(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsUiSceneRoleActor_C*                  UILb__;                                            // 0x1908(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	EWeaponViewName                               UILb;                                              // 0x1910(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_KnucklesCommonL(int32 EntryPoint);
	void Set_Open_Delay();
	void Clear_Open_Delay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_310D0B864C9B9FDD5AB1A599378DF1D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_4F8217FC4233C3220B8F68A4118439A4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_2142C6FB4089F65FAD9632BC498B9E4E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_D0C0979446242DA9475A378EF15BEA9B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_90EFA73E40E6B631821163921AF2E3DF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_488EEA4B4759EB3483F367AD51F1C846();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_4B2557DF48DE489948C0569F7167079E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_CEC3C89A415F156806A7EE9A3519EA09();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_0C16CBA14F46448ECE3E46970EAE09E5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_0F50F8C84F1233D7F4B56380D17345FD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_0A84570F44F20B4FA6A3EA9CFD2D1FAC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_74BE4D3B412F9AE06E771FB461009986();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_382C53EA4686774ED2A7ECBDDD32637A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_7537BBD04A13DB3CC0C86EB02E712CE0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_5791037F45C6D7D06426A1A9DBA9FC81();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_5FF5A53D4739FCCEFF1D06B2D2EEA88C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_75FA068946590EADF99F64ACA6F49A44();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_54587B964E237D842CF4768959AAC106();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_5366F3AA4ABC9AD9CBD6EDA6DBB07CB4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_D331C064441B7F0C7BD1769D46ECC4CC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_B851C0E14C63ECD7B032B2A00B0E056F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_KnucklesCommonL_AnimGraphNode_TransitionResult_C74743B647CC1B8DDCCF03A5BB3EE96B();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_KnucklesCommonL_C">();
	}
	static class UABP_KnucklesCommonL_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_KnucklesCommonL_C>();
	}
};
static_assert(alignof(UABP_KnucklesCommonL_C) == 0x000010, "Wrong alignment on UABP_KnucklesCommonL_C");
static_assert(sizeof(UABP_KnucklesCommonL_C) == 0x001920, "Wrong size on UABP_KnucklesCommonL_C");
static_assert(offsetof(UABP_KnucklesCommonL_C, UberGraphFrame) == 0x000380, "Member 'UABP_KnucklesCommonL_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_Root) == 0x000388, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_27) == 0x0003C0, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_27' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_26) == 0x0003E8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_26' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_25) == 0x000410, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_25' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_24) == 0x000438, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_24' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_23) == 0x000460, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_23' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_22) == 0x000488, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_22' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_21) == 0x0004B0, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_21' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_20) == 0x0004D8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_20' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_19) == 0x000500, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_19' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_18) == 0x000528, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_18' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_17) == 0x000550, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_17' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_16) == 0x000578, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_16' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_15) == 0x0005A0, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_15' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_14) == 0x0005C8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_14' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_13) == 0x0005F0, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_13' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_15) == 0x000618, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_15' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_17) == 0x0006A8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_17' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_14) == 0x0006E0, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_14' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_16) == 0x000770, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_16' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_13) == 0x0007A8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_15) == 0x000838, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_15' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_12) == 0x000870, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_14) == 0x000900, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_14' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_11) == 0x000938, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_13) == 0x0009C8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_13' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_10) == 0x000A00, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_12) == 0x000A90, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_12' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_9) == 0x000AC8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_11) == 0x000B58, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_11' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_8) == 0x000B90, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_10) == 0x000C20, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_10' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateMachine_2) == 0x000C58, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateMachine_2' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_9) == 0x000DA0, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_9' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_12) == 0x000DD8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_12' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_11) == 0x000E00, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_10) == 0x000E28, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_9) == 0x000E50, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_8) == 0x000E78, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_7) == 0x000EA0, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_6) == 0x000EC8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_5) == 0x000EF0, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_4) == 0x000F18, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_3) == 0x000F40, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_2) == 0x000F68, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult_1) == 0x000F90, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_TransitionResult) == 0x000FB8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_7) == 0x000FE0, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_8) == 0x001070, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_8' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_6) == 0x0010A8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_7) == 0x001138, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_5) == 0x001170, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_6) == 0x001200, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_4) == 0x001238, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_5) == 0x0012C8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_3) == 0x001300, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_4) == 0x001390, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_2) == 0x0013C8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_3) == 0x001458, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer_1) == 0x001490, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_2) == 0x001520, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_SequencePlayer) == 0x001558, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult_1) == 0x0015E8, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateMachine_1) == 0x001620, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateMachine_1' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateResult) == 0x001768, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, AnimGraphNode_StateMachine) == 0x0017A0, "Member 'UABP_KnucklesCommonL_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, _r__) == 0x0018E8, "Member 'UABP_KnucklesCommonL_C::_r__' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, Delta_Time) == 0x0018F0, "Member 'UABP_KnucklesCommonL_C::Delta_Time' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, WeaponOpen) == 0x0018F4, "Member 'UABP_KnucklesCommonL_C::WeaponOpen' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, Open_Delay) == 0x0018F8, "Member 'UABP_KnucklesCommonL_C::Open_Delay' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, __s_fh) == 0x0018FC, "Member 'UABP_KnucklesCommonL_C::__s_fh' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, Fh___) == 0x0018FD, "Member 'UABP_KnucklesCommonL_C::Fh___' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, IsUI) == 0x0018FE, "Member 'UABP_KnucklesCommonL_C::IsUI' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, Fh_4I_) == 0x001900, "Member 'UABP_KnucklesCommonL_C::Fh_4I_' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, SMfh_4I_) == 0x001904, "Member 'UABP_KnucklesCommonL_C::SMfh_4I_' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, UILb__) == 0x001908, "Member 'UABP_KnucklesCommonL_C::UILb__' has a wrong offset!");
static_assert(offsetof(UABP_KnucklesCommonL_C, UILb) == 0x001910, "Member 'UABP_KnucklesCommonL_C::UILb' has a wrong offset!");

}

