#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANS_Jueyuan_Huaban

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ANS_Jueyuan_Huaban.ANS_Jueyuan_Huaban_C.K2_NotifyBegin
// 0x0038 (0x0038 - 0x0000)
struct ANS_Jueyuan_Huaban_C_K2_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_MainAnimInstance_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ANS_Jueyuan_Huaban_C_K2_NotifyBegin) == 0x000008, "Wrong alignment on ANS_Jueyuan_Huaban_C_K2_NotifyBegin");
static_assert(sizeof(ANS_Jueyuan_Huaban_C_K2_NotifyBegin) == 0x000038, "Wrong size on ANS_Jueyuan_Huaban_C_K2_NotifyBegin");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyBegin, MeshComp) == 0x000000, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyBegin, Animation) == 0x000008, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyBegin, TotalDuration) == 0x000010, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyBegin, ReturnValue) == 0x000014, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyBegin, K2Node_DynamicCast_AsTs_Base_Character) == 0x000020, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyBegin::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyBegin, CallFunc_MainAnimInstance_ReturnValue) == 0x000030, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyBegin::CallFunc_MainAnimInstance_ReturnValue' has a wrong offset!");

// Function ANS_Jueyuan_Huaban.ANS_Jueyuan_Huaban_C.K2_NotifyTick
// 0x00D0 (0x00D0 - 0x0000)
struct ANS_Jueyuan_Huaban_C_K2_NotifyTick final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDeltaTime;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPathName_ReturnValue;                  // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         CallFunc_SpawnEffect_ReturnValue;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ANS_Jueyuan_Huaban_C_K2_NotifyTick) == 0x000010, "Wrong alignment on ANS_Jueyuan_Huaban_C_K2_NotifyTick");
static_assert(sizeof(ANS_Jueyuan_Huaban_C_K2_NotifyTick) == 0x0000D0, "Wrong size on ANS_Jueyuan_Huaban_C_K2_NotifyTick");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, MeshComp) == 0x000000, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::MeshComp' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, Animation) == 0x000008, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::Animation' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, FrameDeltaTime) == 0x000010, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::FrameDeltaTime' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, ReturnValue) == 0x000014, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000015, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_GetPathName_ReturnValue) == 0x000020, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_GetPathName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000030, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000034, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_GetCurveValue_ReturnValue) == 0x000038, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00003C, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_BreakRotator_Roll) == 0x000048, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_BreakRotator_Pitch) == 0x00004C, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_BreakRotator_Yaw) == 0x000050, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000054, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000058, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x00005C, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_MakeRotator_ReturnValue) == 0x000060, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_IsValid_ReturnValue) == 0x00006C, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_GetSocketLocation_ReturnValue) == 0x000070, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00007C, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyTick, CallFunc_SpawnEffect_ReturnValue) == 0x0000C0, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyTick::CallFunc_SpawnEffect_ReturnValue' has a wrong offset!");

// Function ANS_Jueyuan_Huaban.ANS_Jueyuan_Huaban_C.K2_NotifyEnd
// 0x0018 (0x0018 - 0x0000)
struct ANS_Jueyuan_Huaban_C_K2_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ANS_Jueyuan_Huaban_C_K2_NotifyEnd) == 0x000008, "Wrong alignment on ANS_Jueyuan_Huaban_C_K2_NotifyEnd");
static_assert(sizeof(ANS_Jueyuan_Huaban_C_K2_NotifyEnd) == 0x000018, "Wrong size on ANS_Jueyuan_Huaban_C_K2_NotifyEnd");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyEnd, MeshComp) == 0x000000, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyEnd, Animation) == 0x000008, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(ANS_Jueyuan_Huaban_C_K2_NotifyEnd, ReturnValue) == 0x000010, "Member 'ANS_Jueyuan_Huaban_C_K2_NotifyEnd::ReturnValue' has a wrong offset!");

}

