#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANS_Jueyuan_Huaban

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ANS_Jueyuan_Huaban.ANS_Jueyuan_Huaban_C
// 0x0030 (0x0078 - 0x0048)
class UANS_Jueyuan_Huaban_C final : public UKuroAnimNotifyState
{
public:
	class ATsBaseCharacter_C*                     BP_Jueyuan;                                        // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          MainAnimInstance;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___;                                               // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ______;                                            // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____;                                              // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffectModelGroup_C*                    __yH;                                              // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnDuration;                                     // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool K2_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration);
	bool K2_NotifyTick(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float FrameDeltaTime);
	bool K2_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ANS_Jueyuan_Huaban_C">();
	}
	static class UANS_Jueyuan_Huaban_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANS_Jueyuan_Huaban_C>();
	}
};
static_assert(alignof(UANS_Jueyuan_Huaban_C) == 0x000008, "Wrong alignment on UANS_Jueyuan_Huaban_C");
static_assert(sizeof(UANS_Jueyuan_Huaban_C) == 0x000078, "Wrong size on UANS_Jueyuan_Huaban_C");
static_assert(offsetof(UANS_Jueyuan_Huaban_C, BP_Jueyuan) == 0x000048, "Member 'UANS_Jueyuan_Huaban_C::BP_Jueyuan' has a wrong offset!");
static_assert(offsetof(UANS_Jueyuan_Huaban_C, MainAnimInstance) == 0x000050, "Member 'UANS_Jueyuan_Huaban_C::MainAnimInstance' has a wrong offset!");
static_assert(offsetof(UANS_Jueyuan_Huaban_C, ___) == 0x000058, "Member 'UANS_Jueyuan_Huaban_C::___' has a wrong offset!");
static_assert(offsetof(UANS_Jueyuan_Huaban_C, ______) == 0x00005C, "Member 'UANS_Jueyuan_Huaban_C::______' has a wrong offset!");
static_assert(offsetof(UANS_Jueyuan_Huaban_C, ____) == 0x000060, "Member 'UANS_Jueyuan_Huaban_C::____' has a wrong offset!");
static_assert(offsetof(UANS_Jueyuan_Huaban_C, __yH) == 0x000068, "Member 'UANS_Jueyuan_Huaban_C::__yH' has a wrong offset!");
static_assert(offsetof(UANS_Jueyuan_Huaban_C, SpawnDuration) == 0x000070, "Member 'UANS_Jueyuan_Huaban_C::SpawnDuration' has a wrong offset!");

}

