#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANS_ShowSpecMesh

#include "Basic.hpp"


namespace SDK::Params
{

// Function ANS_ShowSpecMesh.ANS_ShowSpecMesh_C.K2_NotifyBegin
// 0x0098 (0x0098 - 0x0000)
struct ANS_ShowSpecMesh_C_K2_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     RoleActor;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0040(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USkeletalMeshComponent*                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_ELingyangLionHeadMd10011_PC_C*     K2Node_DynamicCast_AsABP_ELingyang_Lion_Head_Md_10011_PC; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_True_if_break_was_hit_Variable;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ANS_ShowSpecMesh_C_K2_NotifyBegin) == 0x000008, "Wrong alignment on ANS_ShowSpecMesh_C_K2_NotifyBegin");
static_assert(sizeof(ANS_ShowSpecMesh_C_K2_NotifyBegin) == 0x000098, "Wrong size on ANS_ShowSpecMesh_C_K2_NotifyBegin");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, MeshComp) == 0x000000, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, Animation) == 0x000008, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, TotalDuration) == 0x000010, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, ReturnValue) == 0x000014, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, RoleActor) == 0x000018, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::RoleActor' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, ___int_Array_Index_Variable) == 0x000020, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, K2Node_DynamicCast_AsTs_Base_Character) == 0x000030, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_K2_GetComponentsByClass_ReturnValue) == 0x000040, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_K2_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_Array_Get_Item) == 0x000050, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_Array_Length_ReturnValue) == 0x000058, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_GetObjectName_ReturnValue) == 0x000060, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_GetAnimInstance_ReturnValue) == 0x000070, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, K2Node_DynamicCast_AsABP_ELingyang_Lion_Head_Md_10011_PC) == 0x000078, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::K2Node_DynamicCast_AsABP_ELingyang_Lion_Head_Md_10011_PC' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, ___int_Loop_Counter_Variable) == 0x000084, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000088, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_Less_IntInt_ReturnValue) == 0x000089, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, ___bool_True_if_break_was_hit_Variable) == 0x000090, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::___bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_Not_PreBool_ReturnValue) == 0x000092, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_BooleanAND_ReturnValue) == 0x000093, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyBegin, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000094, "Member 'ANS_ShowSpecMesh_C_K2_NotifyBegin::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function ANS_ShowSpecMesh.ANS_ShowSpecMesh_C.K2_NotifyEnd
// 0x0038 (0x0038 - 0x0000)
struct ANS_ShowSpecMesh_C_K2_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEffectViewComponent_C*                 Manager;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_ELingyangLionHeadMd10011_PC_C*     K2Node_DynamicCast_AsABP_ELingyang_Lion_Head_Md_10011_PC; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ANS_ShowSpecMesh_C_K2_NotifyEnd) == 0x000008, "Wrong alignment on ANS_ShowSpecMesh_C_K2_NotifyEnd");
static_assert(sizeof(ANS_ShowSpecMesh_C_K2_NotifyEnd) == 0x000038, "Wrong size on ANS_ShowSpecMesh_C_K2_NotifyEnd");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyEnd, MeshComp) == 0x000000, "Member 'ANS_ShowSpecMesh_C_K2_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyEnd, Animation) == 0x000008, "Member 'ANS_ShowSpecMesh_C_K2_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyEnd, ReturnValue) == 0x000010, "Member 'ANS_ShowSpecMesh_C_K2_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyEnd, Manager) == 0x000018, "Member 'ANS_ShowSpecMesh_C_K2_NotifyEnd::Manager' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyEnd, CallFunc_GetAnimInstance_ReturnValue) == 0x000020, "Member 'ANS_ShowSpecMesh_C_K2_NotifyEnd::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyEnd, K2Node_DynamicCast_AsABP_ELingyang_Lion_Head_Md_10011_PC) == 0x000028, "Member 'ANS_ShowSpecMesh_C_K2_NotifyEnd::K2Node_DynamicCast_AsABP_ELingyang_Lion_Head_Md_10011_PC' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyEnd, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'ANS_ShowSpecMesh_C_K2_NotifyEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ANS_ShowSpecMesh_C_K2_NotifyEnd, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'ANS_ShowSpecMesh_C_K2_NotifyEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

