#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANS_ShowSpecMesh

#include "Basic.hpp"

#include "BPE_LionHeadAction_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ANS_ShowSpecMesh.ANS_ShowSpecMesh_C
// 0x0040 (0x0088 - 0x0048)
class UANS_ShowSpecMesh_C final : public UKuroAnimNotifyState
{
public:
	class FString                                 MeshName;                                          // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 TargetComp;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideMeshWhenEnd;                                   // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage_to_Play;                                   // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowBegin;                                         // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachSocket;                                      // 0x0074(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBPE_LionHeadAction                           LionHeadAction;                                    // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool K2_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration);
	bool K2_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ANS_ShowSpecMesh_C">();
	}
	static class UANS_ShowSpecMesh_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANS_ShowSpecMesh_C>();
	}
};
static_assert(alignof(UANS_ShowSpecMesh_C) == 0x000008, "Wrong alignment on UANS_ShowSpecMesh_C");
static_assert(sizeof(UANS_ShowSpecMesh_C) == 0x000088, "Wrong size on UANS_ShowSpecMesh_C");
static_assert(offsetof(UANS_ShowSpecMesh_C, MeshName) == 0x000048, "Member 'UANS_ShowSpecMesh_C::MeshName' has a wrong offset!");
static_assert(offsetof(UANS_ShowSpecMesh_C, TargetComp) == 0x000058, "Member 'UANS_ShowSpecMesh_C::TargetComp' has a wrong offset!");
static_assert(offsetof(UANS_ShowSpecMesh_C, HideMeshWhenEnd) == 0x000060, "Member 'UANS_ShowSpecMesh_C::HideMeshWhenEnd' has a wrong offset!");
static_assert(offsetof(UANS_ShowSpecMesh_C, Montage_to_Play) == 0x000068, "Member 'UANS_ShowSpecMesh_C::Montage_to_Play' has a wrong offset!");
static_assert(offsetof(UANS_ShowSpecMesh_C, ShowBegin) == 0x000070, "Member 'UANS_ShowSpecMesh_C::ShowBegin' has a wrong offset!");
static_assert(offsetof(UANS_ShowSpecMesh_C, AttachSocket) == 0x000074, "Member 'UANS_ShowSpecMesh_C::AttachSocket' has a wrong offset!");
static_assert(offsetof(UANS_ShowSpecMesh_C, LionHeadAction) == 0x000080, "Member 'UANS_ShowSpecMesh_C::LionHeadAction' has a wrong offset!");

}

