#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IC_Jueyuan

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "SInputCommand_structs.hpp"
#include "SSkillInfo_structs.hpp"


namespace SDK::Params
{

// Function BP_IC_Jueyuan.BP_IC_Jueyuan_C.;û	
// 0x0AA0 (0x0AA0 - 0x0000)
struct BP_IC_Jueyuan_C_____ final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSInputCommand                         CallFunc______ReturnValue;                         // 0x0028(0x0014)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSkillIdWithGroupId_ReturnValue;        // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActivePriority_ReturnValue;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue; // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSSkillInfo                            CallFunc_GetSkillInfo_ReturnValue;                 // 0x0058(0x0148)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue;          // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A3[0x1];                                      // 0x01A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand;                   // 0x01A4(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue_1;        // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_1; // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_2; // 0x01BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue_2;        // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_3; // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue_3;        // 0x01BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_4; // 0x01BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ___int_Array_Index_Variable;                       // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ___wildcard_Variable;                              // 0x01C4(0x0014)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPriority_ReturnValue;                  // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_1;                 // 0x01EC(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0202(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0203(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0205(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_206[0x2];                                      // 0x0206(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetTagCount_ReturnValue;                  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_2;                 // 0x0214(0x0014)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput;    // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x3];                                      // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_3;                 // 0x024C(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0278(0x0020)()
	TArray<struct FGameplayTag>                   CallFunc_BreakGameplayTagContainer_GameplayTags;   // 0x0298(0x0010)(ReferenceParm)
	struct FGameplayTag                           CallFunc_Array_Get_Item;                           // 0x02A8(0x000C)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPriority_ReturnValue_1;                // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSkillIdWithGroupId_ReturnValue_1;      // 0x02B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSSkillInfo                            CallFunc_GetSkillInfo_ReturnValue_1;               // 0x02C8(0x0148)(HasGetValueTypeHash)
	float                                         CallFunc_GetActivePriority_ReturnValue_1;          // 0x0410(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_1;      // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0415(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0416(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0417(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0418(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_4;                 // 0x041C(0x0014)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x0430(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue_4;        // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_5;                 // 0x0444(0x0014)(NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_5;           // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_6;                 // 0x0468(0x0014)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPriority_ReturnValue_2;                // 0x047C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetSkillIdWithGroupId_ReturnValue_2;      // 0x0480(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttributeCurrentValue_ReturnValue;     // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActivePriority_ReturnValue_2;          // 0x0494(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x0498(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_2;      // 0x0499(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x049A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x049B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSSkillInfo                            CallFunc_GetSkillInfo_ReturnValue_2;               // 0x04A0(0x0148)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x05EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EB[0x1];                                      // 0x05EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_7;                 // 0x05EC(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_6;                  // 0x0601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_602[0x6];                                      // 0x0602(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSkillIdWithGroupId_ReturnValue_3;      // 0x0608(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSInputCommand                         ___wildcard_Variable_1;                            // 0x0618(0x0014)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetActivePriority_ReturnValue_3;          // 0x062C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ___wildcard_Variable_2;                            // 0x0630(0x0014)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTagCount_ReturnValue_1;                // 0x0644(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_8;                 // 0x064C(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_5; // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_6;           // 0x0668(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_7;           // 0x0678(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1; // 0x0688(0x0020)()
	struct FSInputCommand                         ___wildcard_Variable_3;                            // 0x06A8(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue_5;        // 0x06BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6BD[0x3];                                      // 0x06BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable_1;                                 // 0x06C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand_9;                 // 0x06C4(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue_6;        // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D9[0x7];                                      // 0x06D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_8;           // 0x06E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x06F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6F1[0x7];                                      // 0x06F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSSkillInfo                            CallFunc_GetSkillInfo_ReturnValue_3;               // 0x06F8(0x0148)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_9;           // 0x0840(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPriority_ReturnValue_3;                // 0x0850(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x0854(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_3;      // 0x0855(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_4;                // 0x0856(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0857(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x0858(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_7;                  // 0x0859(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_8;                  // 0x085A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_9;                  // 0x085B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_6; // 0x085C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_10;                 // 0x085D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_11;                 // 0x085E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_12;                 // 0x085F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetPriority_ReturnValue_4;                // 0x0860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_864[0x4];                                      // 0x0864(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSkillIdWithGroupId_ReturnValue_4;      // 0x0868(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSSkillInfo                            CallFunc_GetSkillInfo_ReturnValue_4;               // 0x0878(0x0148)(HasGetValueTypeHash)
	float                                         CallFunc_GetActivePriority_ReturnValue_4;          // 0x09C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue_4;      // 0x09C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_4;          // 0x09C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x09C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_5;                // 0x09C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_5;         // 0x09C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_13;                 // 0x09C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_14;                 // 0x09CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanResponseInput_ReturnValue;             // 0x09CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_15;                 // 0x09CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9CD[0x3];                                      // 0x09CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         ___wildcard_Variable_4;                            // 0x09D0(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_True_if_break_was_hit_Variable;            // 0x09E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_6;                // 0x09E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E6[0x2];                                      // 0x09E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2; // 0x09E8(0x0020)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0A08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0A09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMovingOnGround_ReturnValue;             // 0x0A0A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0A0B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0A0C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_16;                 // 0x0A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0A11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A12[0x2];                                      // 0x0A12(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0A14(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0A18(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A19[0x7];                                      // 0x0A19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_1;  // 0x0A20(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_1;     // 0x0A30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0A31(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMovingOnGround_ReturnValue_1;           // 0x0A32(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0A33(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_7;                 // 0x0A34(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_17;                 // 0x0A35(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0A36(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMovingOnGround_ReturnValue_2;           // 0x0A37(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0A38(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_8;                 // 0x0A39(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_18;                 // 0x0A3A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A3B[0x5];                                      // 0x0A3B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x0A40(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0A50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A51[0x7];                                      // 0x0A51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0A58(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Get_Item_1;                         // 0x0A68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A6C[0x4];                                      // 0x0A6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1; // 0x0A70(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1; // 0x0A80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0A81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A82[0x6];                                      // 0x0A82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput_2;  // 0x0A88(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue_2;     // 0x0A98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_IC_Jueyuan_C_____) == 0x000008, "Wrong alignment on BP_IC_Jueyuan_C_____");
static_assert(sizeof(BP_IC_Jueyuan_C_____) == 0x000AA0, "Wrong size on BP_IC_Jueyuan_C_____");
static_assert(offsetof(BP_IC_Jueyuan_C_____, Time) == 0x000000, "Member 'BP_IC_Jueyuan_C_____::Time' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, ReturnValue) == 0x000004, "Member 'BP_IC_Jueyuan_C_____::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc______ReturnValue) == 0x000028, "Member 'BP_IC_Jueyuan_C_____::CallFunc______ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillIdWithGroupId_ReturnValue) == 0x000040, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillIdWithGroupId_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetActivePriority_ReturnValue) == 0x000050, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetActivePriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue) == 0x000054, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillInfo_ReturnValue) == 0x000058, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001A0, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillAcceptInput_ReturnValue) == 0x0001A1, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillAcceptInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Not_PreBool_ReturnValue) == 0x0001A2, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, K2Node_MakeStruct_SInputCommand) == 0x0001A4, "Member 'BP_IC_Jueyuan_C_____::K2Node_MakeStruct_SInputCommand' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillAcceptInput_ReturnValue_1) == 0x0001B8, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillAcceptInput_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_1) == 0x0001B9, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue) == 0x0001BA, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_2) == 0x0001BB, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillAcceptInput_ReturnValue_2) == 0x0001BC, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillAcceptInput_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_3) == 0x0001BD, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillAcceptInput_ReturnValue_3) == 0x0001BE, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillAcceptInput_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_4) == 0x0001BF, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, ___int_Array_Index_Variable) == 0x0001C0, "Member 'BP_IC_Jueyuan_C_____::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, ___wildcard_Variable) == 0x0001C4, "Member 'BP_IC_Jueyuan_C_____::___wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0001D8, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetPriority_ReturnValue) == 0x0001E8, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetPriority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, K2Node_MakeStruct_SInputCommand_1) == 0x0001EC, "Member 'BP_IC_Jueyuan_C_____::K2Node_MakeStruct_SInputCommand_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000200, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000201, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanAND_ReturnValue) == 0x000202, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_1) == 0x000203, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_2) == 0x000204, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_3) == 0x000205, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetTagCount_ReturnValue) == 0x000208, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetTagCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Less_IntInt_ReturnValue) == 0x00020C, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, ___int_Variable) == 0x000210, "Member 'BP_IC_Jueyuan_C_____::___int_Variable' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, K2Node_MakeStruct_SInputCommand_2) == 0x000214, "Member 'BP_IC_Jueyuan_C_____::K2Node_MakeStruct_SInputCommand_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000228, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x000238, "Member 'BP_IC_Jueyuan_C_____::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000248, "Member 'BP_IC_Jueyuan_C_____::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, K2Node_MakeStruct_SInputCommand_3) == 0x00024C, "Member 'BP_IC_Jueyuan_C_____::K2Node_MakeStruct_SInputCommand_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Not_PreBool_ReturnValue_1) == 0x000260, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000268, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000278, "Member 'BP_IC_Jueyuan_C_____::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BreakGameplayTagContainer_GameplayTags) == 0x000298, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BreakGameplayTagContainer_GameplayTags' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Array_Get_Item) == 0x0002A8, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetPriority_ReturnValue_1) == 0x0002B4, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetPriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillIdWithGroupId_ReturnValue_1) == 0x0002B8, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillIdWithGroupId_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillInfo_ReturnValue_1) == 0x0002C8, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetActivePriority_ReturnValue_1) == 0x000410, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetActivePriority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_FloatFloat_ReturnValue_1) == 0x000414, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000415, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000416, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Not_PreBool_ReturnValue_2) == 0x000417, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Array_Length_ReturnValue) == 0x000418, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, K2Node_MakeStruct_SInputCommand_4) == 0x00041C, "Member 'BP_IC_Jueyuan_C_____::K2Node_MakeStruct_SInputCommand_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Conv_IntToString_ReturnValue_4) == 0x000430, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillAcceptInput_ReturnValue_4) == 0x000440, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillAcceptInput_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, K2Node_MakeStruct_SInputCommand_5) == 0x000444, "Member 'BP_IC_Jueyuan_C_____::K2Node_MakeStruct_SInputCommand_5' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Conv_IntToString_ReturnValue_5) == 0x000458, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Conv_IntToString_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, K2Node_MakeStruct_SInputCommand_6) == 0x000468, "Member 'BP_IC_Jueyuan_C_____::K2Node_MakeStruct_SInputCommand_6' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetPriority_ReturnValue_2) == 0x00047C, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetPriority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillIdWithGroupId_ReturnValue_2) == 0x000480, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillIdWithGroupId_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetAttributeCurrentValue_ReturnValue) == 0x000490, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetAttributeCurrentValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetActivePriority_ReturnValue_2) == 0x000494, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetActivePriority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x000498, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_FloatFloat_ReturnValue_2) == 0x000499, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanAND_ReturnValue_1) == 0x00049A, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Greater_FloatFloat_ReturnValue_3) == 0x00049B, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Greater_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillInfo_ReturnValue_2) == 0x0004A0, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_4) == 0x0005E8, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_5) == 0x0005E9, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0005EA, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, K2Node_MakeStruct_SInputCommand_7) == 0x0005EC, "Member 'BP_IC_Jueyuan_C_____::K2Node_MakeStruct_SInputCommand_7' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Not_PreBool_ReturnValue_3) == 0x000600, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_6) == 0x000601, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillIdWithGroupId_ReturnValue_3) == 0x000608, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillIdWithGroupId_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, ___wildcard_Variable_1) == 0x000618, "Member 'BP_IC_Jueyuan_C_____::___wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetActivePriority_ReturnValue_3) == 0x00062C, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetActivePriority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, ___wildcard_Variable_2) == 0x000630, "Member 'BP_IC_Jueyuan_C_____::___wildcard_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetTagCount_ReturnValue_1) == 0x000644, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetTagCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Add_IntInt_ReturnValue) == 0x000648, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, K2Node_MakeStruct_SInputCommand_8) == 0x00064C, "Member 'BP_IC_Jueyuan_C_____::K2Node_MakeStruct_SInputCommand_8' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_5) == 0x000660, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Conv_IntToString_ReturnValue_6) == 0x000668, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Conv_IntToString_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Conv_IntToString_ReturnValue_7) == 0x000678, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Conv_IntToString_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1) == 0x000688, "Member 'BP_IC_Jueyuan_C_____::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, ___wildcard_Variable_3) == 0x0006A8, "Member 'BP_IC_Jueyuan_C_____::___wildcard_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillAcceptInput_ReturnValue_5) == 0x0006BC, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillAcceptInput_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, ___int_Variable_1) == 0x0006C0, "Member 'BP_IC_Jueyuan_C_____::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, K2Node_MakeStruct_SInputCommand_9) == 0x0006C4, "Member 'BP_IC_Jueyuan_C_____::K2Node_MakeStruct_SInputCommand_9' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillAcceptInput_ReturnValue_6) == 0x0006D8, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillAcceptInput_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Conv_IntToString_ReturnValue_8) == 0x0006E0, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Conv_IntToString_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanAND_ReturnValue_2) == 0x0006F0, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillInfo_ReturnValue_3) == 0x0006F8, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Conv_IntToString_ReturnValue_9) == 0x000840, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Conv_IntToString_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetPriority_ReturnValue_3) == 0x000850, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetPriority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x000854, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_FloatFloat_ReturnValue_3) == 0x000855, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Not_PreBool_ReturnValue_4) == 0x000856, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Not_PreBool_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanAND_ReturnValue_3) == 0x000857, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Greater_FloatFloat_ReturnValue_4) == 0x000858, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Greater_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_7) == 0x000859, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_8) == 0x00085A, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_9) == 0x00085B, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_6) == 0x00085C, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_10) == 0x00085D, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_11) == 0x00085E, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_12) == 0x00085F, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetPriority_ReturnValue_4) == 0x000860, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetPriority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillIdWithGroupId_ReturnValue_4) == 0x000868, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillIdWithGroupId_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetSkillInfo_ReturnValue_4) == 0x000878, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetSkillInfo_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_GetActivePriority_ReturnValue_4) == 0x0009C0, "Member 'BP_IC_Jueyuan_C_____::CallFunc_GetActivePriority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_FloatFloat_ReturnValue_4) == 0x0009C4, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_IntInt_ReturnValue_4) == 0x0009C5, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanAND_ReturnValue_4) == 0x0009C6, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Not_PreBool_ReturnValue_5) == 0x0009C7, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Not_PreBool_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Greater_FloatFloat_ReturnValue_5) == 0x0009C8, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Greater_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_13) == 0x0009C9, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_14) == 0x0009CA, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_CanResponseInput_ReturnValue) == 0x0009CB, "Member 'BP_IC_Jueyuan_C_____::CallFunc_CanResponseInput_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_15) == 0x0009CC, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, ___wildcard_Variable_4) == 0x0009D0, "Member 'BP_IC_Jueyuan_C_____::___wildcard_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, ___bool_True_if_break_was_hit_Variable) == 0x0009E4, "Member 'BP_IC_Jueyuan_C_____::___bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Not_PreBool_ReturnValue_6) == 0x0009E5, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Not_PreBool_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2) == 0x0009E8, "Member 'BP_IC_Jueyuan_C_____::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000A08, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000A09, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_IsMovingOnGround_ReturnValue) == 0x000A0A, "Member 'BP_IC_Jueyuan_C_____::CallFunc_IsMovingOnGround_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanAND_ReturnValue_5) == 0x000A0B, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, ___int_Loop_Counter_Variable) == 0x000A0C, "Member 'BP_IC_Jueyuan_C_____::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_16) == 0x000A10, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Less_IntInt_ReturnValue_1) == 0x000A11, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Add_IntInt_ReturnValue_1) == 0x000A14, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanAND_ReturnValue_6) == 0x000A18, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_HasMatchingGameplayTag_self_CastInput_1) == 0x000A20, "Member 'BP_IC_Jueyuan_C_____::CallFunc_HasMatchingGameplayTag_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_HasMatchingGameplayTag_ReturnValue_1) == 0x000A30, "Member 'BP_IC_Jueyuan_C_____::CallFunc_HasMatchingGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000A31, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_IsMovingOnGround_ReturnValue_1) == 0x000A32, "Member 'BP_IC_Jueyuan_C_____::CallFunc_IsMovingOnGround_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000A33, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanAND_ReturnValue_7) == 0x000A34, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanAND_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_17) == 0x000A35, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000A36, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_IsMovingOnGround_ReturnValue_2) == 0x000A37, "Member 'BP_IC_Jueyuan_C_____::CallFunc_IsMovingOnGround_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000A38, "Member 'BP_IC_Jueyuan_C_____::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanAND_ReturnValue_8) == 0x000A39, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanAND_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_BooleanOR_ReturnValue_18) == 0x000A3A, "Member 'BP_IC_Jueyuan_C_____::CallFunc_BooleanOR_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x000A40, "Member 'BP_IC_Jueyuan_C_____::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000A50, "Member 'BP_IC_Jueyuan_C_____::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, K2Node_MakeArray_Array) == 0x000A58, "Member 'BP_IC_Jueyuan_C_____::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Array_Get_Item_1) == 0x000A68, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1) == 0x000A70, "Member 'BP_IC_Jueyuan_C_____::CallFunc_HasAnyMatchingGameplayTags_self_CastInput_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1) == 0x000A80, "Member 'BP_IC_Jueyuan_C_____::CallFunc_HasAnyMatchingGameplayTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000A81, "Member 'BP_IC_Jueyuan_C_____::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_HasMatchingGameplayTag_self_CastInput_2) == 0x000A88, "Member 'BP_IC_Jueyuan_C_____::CallFunc_HasMatchingGameplayTag_self_CastInput_2' has a wrong offset!");
static_assert(offsetof(BP_IC_Jueyuan_C_____, CallFunc_HasMatchingGameplayTag_ReturnValue_2) == 0x000A98, "Member 'BP_IC_Jueyuan_C_____::CallFunc_HasMatchingGameplayTag_ReturnValue_2' has a wrong offset!");

// Function BP_IC_Jueyuan.BP_IC_Jueyuan_C.ý1	
// 0x0248 (0x0248 - 0x0000)
struct BP_IC_Jueyuan_C___1__ final
{
public:
	float                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ReturnValue;                                       // 0x0004(0x0014)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash)
	struct FSInputCommand                         ___wildcard_Variable;                              // 0x0018(0x0014)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCommonSkillCanBeInterrupt_ReturnValue; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSkillAcceptInput_ReturnValue;          // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSInputCommand                         K2Node_MakeStruct_SInputCommand;                   // 0x0030(0x0014)(NoDestructor, HasGetValueTypeHash)
