#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrailSensorActor

#include "Basic.hpp"

#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "STrailDrawInfo_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TrailSensorActor.BP_TrailSensorActor_C.IsEnable
// 0x0003 (0x0003 - 0x0000)
struct BP_TrailSensorActor_C_IsEnable final
{
public:
	bool                                          Ret;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EKuroFeatureLevel                             CallFunc_GetWorldFeatureLevel_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TrailSensorActor_C_IsEnable) == 0x000001, "Wrong alignment on BP_TrailSensorActor_C_IsEnable");
static_assert(sizeof(BP_TrailSensorActor_C_IsEnable) == 0x000003, "Wrong size on BP_TrailSensorActor_C_IsEnable");
static_assert(offsetof(BP_TrailSensorActor_C_IsEnable, Ret) == 0x000000, "Member 'BP_TrailSensorActor_C_IsEnable::Ret' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_IsEnable, CallFunc_GetWorldFeatureLevel_ReturnValue) == 0x000001, "Member 'BP_TrailSensorActor_C_IsEnable::CallFunc_GetWorldFeatureLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_IsEnable, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_TrailSensorActor_C_IsEnable::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_TrailSensorActor.BP_TrailSensorActor_C.GetPlayerActor
// 0x0010 (0x0010 - 0x0000)
struct BP_TrailSensorActor_C_GetPlayerActor final
{
public:
	class AActor*                                 PlayerActor;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailSensorActor_C_GetPlayerActor) == 0x000008, "Wrong alignment on BP_TrailSensorActor_C_GetPlayerActor");
static_assert(sizeof(BP_TrailSensorActor_C_GetPlayerActor) == 0x000010, "Wrong size on BP_TrailSensorActor_C_GetPlayerActor");
static_assert(offsetof(BP_TrailSensorActor_C_GetPlayerActor, PlayerActor) == 0x000000, "Member 'BP_TrailSensorActor_C_GetPlayerActor::PlayerActor' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_GetPlayerActor, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'BP_TrailSensorActor_C_GetPlayerActor::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");

// Function BP_TrailSensorActor.BP_TrailSensorActor_C.DrawIntoRenderTargets
// 0x00A0 (0x00A0 - 0x0000)
struct BP_TrailSensorActor_C_DrawIntoRenderTargets final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTrailDrawInfo                        CallFunc_Array_Get_Item;                           // 0x0050(0x0020)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0090(0x0010)(NoDestructor)
};
static_assert(alignof(BP_TrailSensorActor_C_DrawIntoRenderTargets) == 0x000008, "Wrong alignment on BP_TrailSensorActor_C_DrawIntoRenderTargets");
static_assert(sizeof(BP_TrailSensorActor_C_DrawIntoRenderTargets) == 0x0000A0, "Wrong size on BP_TrailSensorActor_C_DrawIntoRenderTargets");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, ___int_Array_Index_Variable) == 0x000000, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_BreakVector2D_X) == 0x00000C, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_BreakVector2D_Y) == 0x000010, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000018, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_BreakVector2D_X_1) == 0x00001C, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_BreakVector2D_Y_1) == 0x000020, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000024, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000028, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00002C, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000030, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000038, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_BreakVector2D_X_2) == 0x000040, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_BreakVector2D_Y_2) == 0x000044, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, ___int_Loop_Counter_Variable) == 0x000048, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000080, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000088, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawIntoRenderTargets, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000090, "Member 'BP_TrailSensorActor_C_DrawIntoRenderTargets::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");

// Function BP_TrailSensorActor.BP_TrailSensorActor_C.Init Render Targets
// 0x0048 (0x0048 - 0x0000)
struct BP_TrailSensorActor_C_Init_Render_Targets final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_1;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_2;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_3;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_4;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailSensorActor_C_Init_Render_Targets) == 0x000008, "Wrong alignment on BP_TrailSensorActor_C_Init_Render_Targets");
static_assert(sizeof(BP_TrailSensorActor_C_Init_Render_Targets) == 0x000048, "Wrong size on BP_TrailSensorActor_C_Init_Render_Targets");
static_assert(offsetof(BP_TrailSensorActor_C_Init_Render_Targets, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_TrailSensorActor_C_Init_Render_Targets::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_Init_Render_Targets, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'BP_TrailSensorActor_C_Init_Render_Targets::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_Init_Render_Targets, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000010, "Member 'BP_TrailSensorActor_C_Init_Render_Targets::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_Init_Render_Targets, CallFunc_CreateRenderTarget2D_ReturnValue_1) == 0x000018, "Member 'BP_TrailSensorActor_C_Init_Render_Targets::CallFunc_CreateRenderTarget2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_Init_Render_Targets, CallFunc_CreateRenderTarget2D_ReturnValue_2) == 0x000020, "Member 'BP_TrailSensorActor_C_Init_Render_Targets::CallFunc_CreateRenderTarget2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_Init_Render_Targets, CallFunc_CreateRenderTarget2D_ReturnValue_3) == 0x000028, "Member 'BP_TrailSensorActor_C_Init_Render_Targets::CallFunc_CreateRenderTarget2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_Init_Render_Targets, CallFunc_CreateRenderTarget2D_ReturnValue_4) == 0x000030, "Member 'BP_TrailSensorActor_C_Init_Render_Targets::CallFunc_CreateRenderTarget2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_Init_Render_Targets, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000038, "Member 'BP_TrailSensorActor_C_Init_Render_Targets::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_Init_Render_Targets, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000040, "Member 'BP_TrailSensorActor_C_Init_Render_Targets::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");

// Function BP_TrailSensorActor.BP_TrailSensorActor_C.UpDatePosition
// 0x0170 (0x0170 - 0x0000)
struct BP_TrailSensorActor_C_UpDatePosition final
{
public:
	struct FVector2D                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetPlayerActor_PlayerActor;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0078(0x0094)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0154(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x015C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailSensorActor_C_UpDatePosition) == 0x000010, "Wrong alignment on BP_TrailSensorActor_C_UpDatePosition");
static_assert(sizeof(BP_TrailSensorActor_C_UpDatePosition) == 0x000170, "Wrong size on BP_TrailSensorActor_C_UpDatePosition");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, ReturnValue) == 0x000000, "Member 'BP_TrailSensorActor_C_UpDatePosition::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_GetPlayerActor_PlayerActor) == 0x000008, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_GetPlayerActor_PlayerActor' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_BreakTransform_Location) == 0x000050, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, ___bool_Variable) == 0x000074, "Member 'BP_TrailSensorActor_C_UpDatePosition::___bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000078, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00010C, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000118, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000120, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x00012C, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000134, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_BreakVector2D_X) == 0x00013C, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_BreakVector2D_Y) == 0x000140, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_FFloor_ReturnValue) == 0x000144, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_FFloor_ReturnValue_1) == 0x000148, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00014C, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000150, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_MakeVector2D_ReturnValue) == 0x000154, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x00015C, "Member 'BP_TrailSensorActor_C_UpDatePosition::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UpDatePosition, K2Node_Select_Default) == 0x000164, "Member 'BP_TrailSensorActor_C_UpDatePosition::K2Node_Select_Default' has a wrong offset!");

// Function BP_TrailSensorActor.BP_TrailSensorActor_C.CreateRTandMat
// 0x00A0 (0x00A0 - 0x0000)
struct BP_TrailSensorActor_C_CreateRTandMat final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_1;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_1;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_2;       // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_3;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_4;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailSensorActor_C_CreateRTandMat) == 0x000008, "Wrong alignment on BP_TrailSensorActor_C_CreateRTandMat");
static_assert(sizeof(BP_TrailSensorActor_C_CreateRTandMat) == 0x0000A0, "Wrong size on BP_TrailSensorActor_C_CreateRTandMat");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000008, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000010, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_BreakVector2D_X) == 0x000014, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000020, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000024, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000028, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000030, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000038, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_BreakVector2D_X_1) == 0x000040, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_BreakVector2D_Y_1) == 0x000044, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_Divide_Vector2DFloat_ReturnValue_1) == 0x000048, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_Divide_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_FTrunc_ReturnValue) == 0x000050, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_BreakVector2D_X_2) == 0x000054, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_BreakVector2D_Y_2) == 0x000058, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_FTrunc_ReturnValue_1) == 0x00005C, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_FTrunc_ReturnValue_2) == 0x000060, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000068, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_FTrunc_ReturnValue_3) == 0x000070, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_FTrunc_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_CreateRenderTarget2D_ReturnValue_1) == 0x000078, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_CreateRenderTarget2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_CreateRenderTarget2D_ReturnValue_2) == 0x000080, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_CreateRenderTarget2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_CreateRenderTarget2D_ReturnValue_3) == 0x000088, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_CreateRenderTarget2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_CreateRenderTarget2D_ReturnValue_4) == 0x000090, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_CreateRenderTarget2D_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_CreateRTandMat, CallFunc_CreateDynamicMaterialInstance_ReturnValue_3) == 0x000098, "Member 'BP_TrailSensorActor_C_CreateRTandMat::CallFunc_CreateDynamicMaterialInstance_ReturnValue_3' has a wrong offset!");

// Function BP_TrailSensorActor.BP_TrailSensorActor_C.DrawToCurrentFrame
// 0x0088 (0x0088 - 0x0000)
struct BP_TrailSensorActor_C_DrawToCurrentFrame final
{
public:
	class UCanvas*                                Canvas;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSTrailDrawInfo                        DrawInfo;                                          // 0x0008(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_FloatToLinearColor_ReturnValue;      // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue;                 // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_1;       // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_2;       // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue_3;       // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue_1;       // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailSensorActor_C_DrawToCurrentFrame) == 0x000008, "Wrong alignment on BP_TrailSensorActor_C_DrawToCurrentFrame");
static_assert(sizeof(BP_TrailSensorActor_C_DrawToCurrentFrame) == 0x000088, "Wrong size on BP_TrailSensorActor_C_DrawToCurrentFrame");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, Canvas) == 0x000000, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::Canvas' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, DrawInfo) == 0x000008, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::DrawInfo' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, CallFunc_Conv_FloatToLinearColor_ReturnValue) == 0x000028, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::CallFunc_Conv_FloatToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, CallFunc_Add_FloatFloat_ReturnValue) == 0x000038, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x00003C, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000044, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, CallFunc_GetRotated2D_ReturnValue) == 0x00004C, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::CallFunc_GetRotated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000054, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, CallFunc_Divide_Vector2DFloat_ReturnValue_1) == 0x00005C, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::CallFunc_Divide_Vector2DFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, CallFunc_Divide_Vector2DFloat_ReturnValue_2) == 0x000064, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::CallFunc_Divide_Vector2DFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, CallFunc_Divide_Vector2DFloat_ReturnValue_3) == 0x00006C, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::CallFunc_Divide_Vector2DFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, CallFunc_Subtract_Vector2DVector2D_ReturnValue_1) == 0x000074, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::CallFunc_Subtract_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_DrawToCurrentFrame, CallFunc_Add_Vector2DVector2D_ReturnValue_1) == 0x00007C, "Member 'BP_TrailSensorActor_C_DrawToCurrentFrame::CallFunc_Add_Vector2DVector2D_ReturnValue_1' has a wrong offset!");

// Function BP_TrailSensorActor.BP_TrailSensorActor_C.UserConstructionScript
// 0x0130 (0x0130 - 0x0000)
struct BP_TrailSensorActor_C_UserConstructionScript final
{
public:
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnable_Ret;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldTransform_SweepHitResult;      // 0x008C(0x0094)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailSensorActor_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_TrailSensorActor_C_UserConstructionScript");
static_assert(sizeof(BP_TrailSensorActor_C_UserConstructionScript) == 0x000130, "Wrong size on BP_TrailSensorActor_C_UserConstructionScript");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_MakeRotator_ReturnValue) == 0x000000, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_IsEnable_Ret) == 0x00000C, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_IsEnable_Ret' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_BreakVector2D_X) == 0x000010, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_BreakVector2D_Y) == 0x000014, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000024, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000030, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000034, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000038, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_BreakVector2D_X_1) == 0x00003C, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_BreakVector2D_Y_1) == 0x000040, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue_1) == 0x000044, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000080, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_K2_SetWorldTransform_SweepHitResult) == 0x00008C, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_K2_SetWorldTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_UserConstructionScript, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000120, "Member 'BP_TrailSensorActor_C_UserConstructionScript::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");

// Function BP_TrailSensorActor.BP_TrailSensorActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TrailSensorActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailSensorActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TrailSensorActor_C_ReceiveTick");
static_assert(sizeof(BP_TrailSensorActor_C_ReceiveTick) == 0x000004, "Wrong size on BP_TrailSensorActor_C_ReceiveTick");
static_assert(offsetof(BP_TrailSensorActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TrailSensorActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TrailSensorActor.BP_TrailSensorActor_C.ExecuteUbergraph_BP_TrailSensorActor
// 0x0030 (0x0030 - 0x0000)
struct BP_TrailSensorActor_C_ExecuteUbergraph_BP_TrailSensorActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_UpDatePosition_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnable_Ret;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnable_Ret_1;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnable_Ret_2;                           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TrailsManager_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TrailSensorActor_C_ExecuteUbergraph_BP_TrailSensorActor) == 0x000008, "Wrong alignment on BP_TrailSensorActor_C_ExecuteUbergraph_BP_TrailSensorActor");
static_assert(sizeof(BP_TrailSensorActor_C_ExecuteUbergraph_BP_TrailSensorActor) == 0x000030, "Wrong size on BP_TrailSensorActor_C_ExecuteUbergraph_BP_TrailSensorActor");
static_assert(offsetof(BP_TrailSensorActor_C_ExecuteUbergraph_BP_TrailSensorActor, EntryPoint) == 0x000000, "Member 'BP_TrailSensorActor_C_ExecuteUbergraph_BP_TrailSensorActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TrailSensorActor_C_ExecuteUbergraph_BP_TrailSensorActor, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_TrailSensorActor_C_ExecuteUbergraph_BP_TrailSensorActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
