#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrailDrawActor

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TrailDrawActor.BP_TrailDrawActor_C
// 0x0018 (0x02C0 - 0x02A8)
class ABP_TrailDrawActor_C : public AActor
{
public:
	class UBP_TrailDrawComponent_C*               DrawComponent;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabled;                                         // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void IsEnable(bool* Ret);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TrailDrawActor_C">();
	}
	static class ABP_TrailDrawActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TrailDrawActor_C>();
	}
};
static_assert(alignof(ABP_TrailDrawActor_C) == 0x000008, "Wrong alignment on ABP_TrailDrawActor_C");
static_assert(sizeof(ABP_TrailDrawActor_C) == 0x0002C0, "Wrong size on ABP_TrailDrawActor_C");
static_assert(offsetof(ABP_TrailDrawActor_C, DrawComponent) == 0x0002A8, "Member 'ABP_TrailDrawActor_C::DrawComponent' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_TrailDrawActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_C, IsEnabled) == 0x0002B8, "Member 'ABP_TrailDrawActor_C::IsEnabled' has a wrong offset!");

}

