#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrailSensor_Snow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_TrailSensor_Snow.BP_TrailSensor_Snow_C.ExecuteUbergraph_BP_TrailSensor_Snow
// 0x0024 (0x0024 - 0x0000)
struct BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow) == 0x000004, "Wrong alignment on BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow");
static_assert(sizeof(BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow) == 0x000024, "Wrong size on BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow");
static_assert(offsetof(BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow, EntryPoint) == 0x000000, "Member 'BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow, CallFunc_BreakVector2D_X) == 0x000004, "Member 'BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow, CallFunc_BreakVector2D_X_1) == 0x00000C, "Member 'BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow, CallFunc_BreakVector2D_Y_1) == 0x000010, "Member 'BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow, K2Node_MakeStruct_LinearColor) == 0x000014, "Member 'BP_TrailSensor_Snow_C_ExecuteUbergraph_BP_TrailSensor_Snow::K2Node_MakeStruct_LinearColor' has a wrong offset!");

}

