#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrailsManager

#include "Basic.hpp"

#include "STrailLandPair_structs.hpp"
#include "KuroRenderingRuntimeBPPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "STrailDrawInfo_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TrailsManager.BP_TrailsManager_C.OnProxyShow
// 0x0008 (0x0008 - 0x0000)
struct BP_TrailsManager_C_OnProxyShow final
{
public:
	class ALandscapeStreamingProxy*               Proxy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailsManager_C_OnProxyShow) == 0x000008, "Wrong alignment on BP_TrailsManager_C_OnProxyShow");
static_assert(sizeof(BP_TrailsManager_C_OnProxyShow) == 0x000008, "Wrong size on BP_TrailsManager_C_OnProxyShow");
static_assert(offsetof(BP_TrailsManager_C_OnProxyShow, Proxy) == 0x000000, "Member 'BP_TrailsManager_C_OnProxyShow::Proxy' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.OnProxyHide
// 0x0008 (0x0008 - 0x0000)
struct BP_TrailsManager_C_OnProxyHide final
{
public:
	class ALandscapeStreamingProxy*               Proxy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailsManager_C_OnProxyHide) == 0x000008, "Wrong alignment on BP_TrailsManager_C_OnProxyHide");
static_assert(sizeof(BP_TrailsManager_C_OnProxyHide) == 0x000008, "Wrong size on BP_TrailsManager_C_OnProxyHide");
static_assert(offsetof(BP_TrailsManager_C_OnProxyHide, Proxy) == 0x000000, "Member 'BP_TrailsManager_C_OnProxyHide::Proxy' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.ExecuteUbergraph_BP_TrailsManager
// 0x01F8 (0x01F8 - 0x0000)
struct BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TrailDrawComponent_C*               CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSTrailDrawInfo                        K2Node_MakeStruct_STrailDrawInfo;                  // 0x0030(0x0020)(IsPlainOldData, NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue;                 // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x008D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x008E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F[0x1];                                       // 0x008F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_TrailSensorActor_C*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0098(0x0010)(ReferenceParm)
	TArray<class ABP_TrailsManager_C*>            CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x00A8(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0169(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x016A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16B[0x1];                                      // 0x016B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALandscapeStreamingProxy*               K2Node_Event_Proxy_1;                              // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALandscapeStreamingProxy*               K2Node_Event_Proxy;                                // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTag_Tag;                               // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetTag_Tag_1;                             // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x01B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_2;                     // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TrailSensorActor_C*                 CallFunc_Array_Get_Item_1;                         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_TrailSensorActor_C*                 CallFunc_Array_Get_Item_2;                         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEnabled_ReturnValue;                    // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnabled_ReturnValue_1;                  // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1EE[0x2];                                      // 0x01EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnabled_ReturnValue_2;                  // 0x01F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnabled_ReturnValue_3;                  // 0x01F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager) == 0x000008, "Wrong alignment on BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager");
static_assert(sizeof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager) == 0x0001F8, "Wrong size on BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, EntryPoint) == 0x000000, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, ___int_Array_Index_Variable) == 0x000004, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, ___int_Loop_Counter_Variable) == 0x000008, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, K2Node_Event_DeltaSeconds) == 0x000010, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Length_ReturnValue_1) == 0x000028, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, K2Node_MakeStruct_STrailDrawInfo) == 0x000030, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::K2Node_MakeStruct_STrailDrawInfo' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000050, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_GetRotated2D_ReturnValue) == 0x00005C, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_GetRotated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Divide_Vector2DFloat_ReturnValue) == 0x000064, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Divide_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BreakVector2D_X) == 0x00006C, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BreakVector2D_Y) == 0x000070, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000074, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Abs_ReturnValue) == 0x00007C, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BreakVector2D_X_1) == 0x000080, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BreakVector2D_Y_1) == 0x000084, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Abs_ReturnValue_1) == 0x000088, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00008C, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x00008D, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BooleanAND_ReturnValue) == 0x00008E, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x000098, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x0000A8, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Length_ReturnValue_2) == 0x0000B8, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Length_ReturnValue_3) == 0x0000C0, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, K2Node_MakeStruct_FormatArgumentData) == 0x0000C8, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, K2Node_MakeArray_Array) == 0x000108, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Length_ReturnValue_4) == 0x000118, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Format_ReturnValue) == 0x000120, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Less_IntInt_ReturnValue) == 0x000138, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Conv_TextToString_ReturnValue) == 0x000140, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Length_ReturnValue_5) == 0x000150, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Greater_IntInt_ReturnValue) == 0x000154, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Length_ReturnValue_6) == 0x000158, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00015C, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Length_ReturnValue_7) == 0x000160, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, ___int_Loop_Counter_Variable_1) == 0x000164, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000168, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BooleanAND_ReturnValue_1) == 0x000169, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Less_IntInt_ReturnValue_1) == 0x00016A, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Add_IntInt_ReturnValue_1) == 0x00016C, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, K2Node_Event_Proxy_1) == 0x000170, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::K2Node_Event_Proxy_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, K2Node_Event_Proxy) == 0x000178, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::K2Node_Event_Proxy' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_GetTag_Tag) == 0x000180, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_GetTag_Tag' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_GetTag_Tag_1) == 0x000190, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_GetTag_Tag_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Concat_StrStr_ReturnValue) == 0x0001A0, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0001B0, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, ___int_Array_Index_Variable_1) == 0x0001C0, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, ___int_Array_Index_Variable_2) == 0x0001C4, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::___int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Get_Item_1) == 0x0001C8, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Get_Item_2) == 0x0001D0, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_RemoveItem_ReturnValue) == 0x0001D8, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_IsValid_ReturnValue_1) == 0x0001D9, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Add_ReturnValue_1) == 0x0001DC, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, ___int_Loop_Counter_Variable_2) == 0x0001E0, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::___int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001E4, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Add_IntInt_ReturnValue_2) == 0x0001E8, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_IsEnabled_ReturnValue) == 0x0001EC, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_IsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_IsEnabled_ReturnValue_1) == 0x0001ED, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_IsEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x0001F0, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0001F4, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_IsEnabled_ReturnValue_2) == 0x0001F5, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_IsEnabled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_IsEnabled_ReturnValue_3) == 0x0001F6, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_IsEnabled_ReturnValue_3' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TrailsManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailsManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TrailsManager_C_ReceiveTick");
static_assert(sizeof(BP_TrailsManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_TrailsManager_C_ReceiveTick");
static_assert(offsetof(BP_TrailsManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TrailsManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.IsEnable
// 0x0003 (0x0003 - 0x0000)
struct BP_TrailsManager_C_IsEnable final
{
public:
	bool                                          Param_IsEnable;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EKuroFeatureLevel                             CallFunc_GetWorldFeatureLevel_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TrailsManager_C_IsEnable) == 0x000001, "Wrong alignment on BP_TrailsManager_C_IsEnable");
static_assert(sizeof(BP_TrailsManager_C_IsEnable) == 0x000003, "Wrong size on BP_TrailsManager_C_IsEnable");
static_assert(offsetof(BP_TrailsManager_C_IsEnable, Param_IsEnable) == 0x000000, "Member 'BP_TrailsManager_C_IsEnable::Param_IsEnable' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_IsEnable, CallFunc_GetWorldFeatureLevel_ReturnValue) == 0x000001, "Member 'BP_TrailsManager_C_IsEnable::CallFunc_GetWorldFeatureLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_IsEnable, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'BP_TrailsManager_C_IsEnable::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.ShowProxy
// 0x0028 (0x0028 - 0x0000)
struct BP_TrailsManager_C_ShowProxy final
{
public:
	class ALandscapeStreamingProxy*               Proxy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_Ret;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ContainsTag_Index;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_Ret_1;                        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ContainsTag_Index_1;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailsManager_C_ShowProxy) == 0x000008, "Wrong alignment on BP_TrailsManager_C_ShowProxy");
static_assert(sizeof(BP_TrailsManager_C_ShowProxy) == 0x000028, "Wrong size on BP_TrailsManager_C_ShowProxy");
static_assert(offsetof(BP_TrailsManager_C_ShowProxy, Proxy) == 0x000000, "Member 'BP_TrailsManager_C_ShowProxy::Proxy' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ShowProxy, CallFunc_ContainsTag_Ret) == 0x000008, "Member 'BP_TrailsManager_C_ShowProxy::CallFunc_ContainsTag_Ret' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ShowProxy, CallFunc_ContainsTag_Index) == 0x00000C, "Member 'BP_TrailsManager_C_ShowProxy::CallFunc_ContainsTag_Index' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ShowProxy, CallFunc_Array_AddUnique_ReturnValue) == 0x000010, "Member 'BP_TrailsManager_C_ShowProxy::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ShowProxy, CallFunc_ContainsTag_Ret_1) == 0x000014, "Member 'BP_TrailsManager_C_ShowProxy::CallFunc_ContainsTag_Ret_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ShowProxy, CallFunc_ContainsTag_Index_1) == 0x000018, "Member 'BP_TrailsManager_C_ShowProxy::CallFunc_ContainsTag_Index_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ShowProxy, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'BP_TrailsManager_C_ShowProxy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ShowProxy, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000020, "Member 'BP_TrailsManager_C_ShowProxy::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.HideProxy
// 0x0020 (0x0020 - 0x0000)
struct BP_TrailsManager_C_HideProxy final
{
public:
	class ALandscapeStreamingProxy*               Proxy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_Ret;                          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ContainsTag_Index;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ContainsTag_Ret_1;                        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_ContainsTag_Index_1;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue_1;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TrailsManager_C_HideProxy) == 0x000008, "Wrong alignment on BP_TrailsManager_C_HideProxy");
static_assert(sizeof(BP_TrailsManager_C_HideProxy) == 0x000020, "Wrong size on BP_TrailsManager_C_HideProxy");
static_assert(offsetof(BP_TrailsManager_C_HideProxy, Proxy) == 0x000000, "Member 'BP_TrailsManager_C_HideProxy::Proxy' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_HideProxy, CallFunc_ContainsTag_Ret) == 0x000008, "Member 'BP_TrailsManager_C_HideProxy::CallFunc_ContainsTag_Ret' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_HideProxy, CallFunc_ContainsTag_Index) == 0x00000C, "Member 'BP_TrailsManager_C_HideProxy::CallFunc_ContainsTag_Index' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_HideProxy, CallFunc_Array_RemoveItem_ReturnValue) == 0x000010, "Member 'BP_TrailsManager_C_HideProxy::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_HideProxy, CallFunc_ContainsTag_Ret_1) == 0x000011, "Member 'BP_TrailsManager_C_HideProxy::CallFunc_ContainsTag_Ret_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_HideProxy, CallFunc_ContainsTag_Index_1) == 0x000014, "Member 'BP_TrailsManager_C_HideProxy::CallFunc_ContainsTag_Index_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_HideProxy, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'BP_TrailsManager_C_HideProxy::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_HideProxy, CallFunc_Array_RemoveItem_ReturnValue_1) == 0x000019, "Member 'BP_TrailsManager_C_HideProxy::CallFunc_Array_RemoveItem_ReturnValue_1' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.ContainsTag
// 0x0068 (0x0068 - 0x0000)
struct BP_TrailsManager_C_ContainsTag final
{
public:
	class ALandscapeStreamingProxy*               Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Str;                                               // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Param_Index;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailsManager_C_ContainsTag) == 0x000008, "Wrong alignment on BP_TrailsManager_C_ContainsTag");
static_assert(sizeof(BP_TrailsManager_C_ContainsTag) == 0x000068, "Wrong size on BP_TrailsManager_C_ContainsTag");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, Actor) == 0x000000, "Member 'BP_TrailsManager_C_ContainsTag::Actor' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, Str) == 0x000008, "Member 'BP_TrailsManager_C_ContainsTag::Str' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, Ret) == 0x000014, "Member 'BP_TrailsManager_C_ContainsTag::Ret' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, Param_Index) == 0x000018, "Member 'BP_TrailsManager_C_ContainsTag::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, CallFunc_Conv_NameToString_ReturnValue) == 0x000020, "Member 'BP_TrailsManager_C_ContainsTag::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, ___int_Array_Index_Variable) == 0x000030, "Member 'BP_TrailsManager_C_ContainsTag::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'BP_TrailsManager_C_ContainsTag::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_TrailsManager_C_ContainsTag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000048, "Member 'BP_TrailsManager_C_ContainsTag::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, CallFunc_Contains_ReturnValue) == 0x000058, "Member 'BP_TrailsManager_C_ContainsTag::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, ___int_Loop_Counter_Variable) == 0x00005C, "Member 'BP_TrailsManager_C_ContainsTag::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, CallFunc_Less_IntInt_ReturnValue) == 0x000060, "Member 'BP_TrailsManager_C_ContainsTag::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ContainsTag, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'BP_TrailsManager_C_ContainsTag::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.GetTag
// 0x0040 (0x0040 - 0x0000)
struct BP_TrailsManager_C_GetTag final
{
public:
	class ALandscapeStreamingProxy*               Proxy;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Param_Index;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Tag;                                               // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailsManager_C_GetTag) == 0x000008, "Wrong alignment on BP_TrailsManager_C_GetTag");
static_assert(sizeof(BP_TrailsManager_C_GetTag) == 0x000040, "Wrong size on BP_TrailsManager_C_GetTag");
static_assert(offsetof(BP_TrailsManager_C_GetTag, Proxy) == 0x000000, "Member 'BP_TrailsManager_C_GetTag::Proxy' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_GetTag, Param_Index) == 0x000008, "Member 'BP_TrailsManager_C_GetTag::Param_Index' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_GetTag, Tag) == 0x000010, "Member 'BP_TrailsManager_C_GetTag::Tag' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_GetTag, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_TrailsManager_C_GetTag::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_GetTag, CallFunc_Conv_NameToString_ReturnValue) == 0x000030, "Member 'BP_TrailsManager_C_GetTag::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.UpdateLandscapes
// 0x00B8 (0x00B8 - 0x0000)
struct BP_TrailsManager_C_UpdateLandscapes final
{
public:
	TArray<bool>                                  TempVisible;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         TempCount;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class ALandscapeStreamingProxy*, struct FSTrailLandPair> LowLand;                                           // 0x0018(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TMap<class ALandscapeStreamingProxy*, bool>   HighLand;                                          // 0x0068(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate)
};
static_assert(alignof(BP_TrailsManager_C_UpdateLandscapes) == 0x000008, "Wrong alignment on BP_TrailsManager_C_UpdateLandscapes");
static_assert(sizeof(BP_TrailsManager_C_UpdateLandscapes) == 0x0000B8, "Wrong size on BP_TrailsManager_C_UpdateLandscapes");
static_assert(offsetof(BP_TrailsManager_C_UpdateLandscapes, TempVisible) == 0x000000, "Member 'BP_TrailsManager_C_UpdateLandscapes::TempVisible' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_UpdateLandscapes, TempCount) == 0x000010, "Member 'BP_TrailsManager_C_UpdateLandscapes::TempCount' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_UpdateLandscapes, LowLand) == 0x000018, "Member 'BP_TrailsManager_C_UpdateLandscapes::LowLand' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_UpdateLandscapes, HighLand) == 0x000068, "Member 'BP_TrailsManager_C_UpdateLandscapes::HighLand' has a wrong offset!");

}

