#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrailDrawActor_Capture

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_TrailDrawActor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TrailDrawActor_Capture.BP_TrailDrawActor_Capture_C
// 0x0078 (0x0338 - 0x02C0)
class ABP_TrailDrawActor_Capture_C final : public ABP_TrailDrawActor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         OrthoWidth;                                        // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CaptureTexture;                                    // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MirrorMat;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      Object_Types;                                      // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         PixelWidth;                                        // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Father;                                            // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastLocation;                                      // 0x0308(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseBoundOrigin;                                    // 0x0314(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_315[0x3];                                      // 0x0315(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 RT1;                                               // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RT2;                                               // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ZOffset;                                           // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UpdateEveryTick;                                   // 0x032C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32D[0x3];                                      // 0x032D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RayUp;                                             // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RayDown;                                           // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_TrailDrawActor_Capture(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TrailDrawActor_Capture_C">();
	}
	static class ABP_TrailDrawActor_Capture_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TrailDrawActor_Capture_C>();
	}
};
static_assert(alignof(ABP_TrailDrawActor_Capture_C) == 0x000008, "Wrong alignment on ABP_TrailDrawActor_Capture_C");
static_assert(sizeof(ABP_TrailDrawActor_Capture_C) == 0x000338, "Wrong size on ABP_TrailDrawActor_Capture_C");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, UberGraphFrame) == 0x0002C0, "Member 'ABP_TrailDrawActor_Capture_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, SceneCaptureComponent2D) == 0x0002C8, "Member 'ABP_TrailDrawActor_Capture_C::SceneCaptureComponent2D' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, OrthoWidth) == 0x0002D0, "Member 'ABP_TrailDrawActor_Capture_C::OrthoWidth' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, CaptureTexture) == 0x0002D8, "Member 'ABP_TrailDrawActor_Capture_C::CaptureTexture' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, MirrorMat) == 0x0002E0, "Member 'ABP_TrailDrawActor_Capture_C::MirrorMat' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, Object_Types) == 0x0002E8, "Member 'ABP_TrailDrawActor_Capture_C::Object_Types' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, PixelWidth) == 0x0002F8, "Member 'ABP_TrailDrawActor_Capture_C::PixelWidth' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, Father) == 0x000300, "Member 'ABP_TrailDrawActor_Capture_C::Father' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, LastLocation) == 0x000308, "Member 'ABP_TrailDrawActor_Capture_C::LastLocation' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, UseBoundOrigin) == 0x000314, "Member 'ABP_TrailDrawActor_Capture_C::UseBoundOrigin' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, RT1) == 0x000318, "Member 'ABP_TrailDrawActor_Capture_C::RT1' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, RT2) == 0x000320, "Member 'ABP_TrailDrawActor_Capture_C::RT2' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, ZOffset) == 0x000328, "Member 'ABP_TrailDrawActor_Capture_C::ZOffset' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, UpdateEveryTick) == 0x00032C, "Member 'ABP_TrailDrawActor_Capture_C::UpdateEveryTick' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, RayUp) == 0x000330, "Member 'ABP_TrailDrawActor_Capture_C::RayUp' has a wrong offset!");
static_assert(offsetof(ABP_TrailDrawActor_Capture_C, RayDown) == 0x000334, "Member 'ABP_TrailDrawActor_Capture_C::RayDown' has a wrong offset!");

}

