#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Comboo_Vision

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "SHitInformation_structs.hpp"


namespace SDK::Params
{

// Function GA_Comboo_Vision.GA_Comboo_Vision_C.ExecuteUbergraph_GA_Comboo_Vision
// 0x0FE8 (0x0FE8 - 0x0000)
struct GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc____________;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0088(0x0028)(ZeroConstructor)
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x00B0(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayTag& Tag)>     K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C0(0x0028)(ZeroConstructor)
	struct FGameplayTag                           ___struct_Variable;                                // 0x00E8(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x00F8(0x0028)(ZeroConstructor)
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0120(0x00B8)()
	struct FGameplayEventData                     ___struct_Variable_1;                              // 0x01D8(0x00B8)()
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ATsBaseCharacter_C* _r, const struct FSHitInformation& __pn)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x02A0(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x02F8(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________2;                              // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ___struct_Variable_2;                              // 0x0330(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0340(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_____GA______________;                     // 0x0360(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0370(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayTag& Tag)>     K2Node_CreateDelegate_OutputDelegate_8;            // 0x0390(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________3;                              // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x03C8(0x0028)(ZeroConstructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402[0x2];                                      // 0x0402(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio;                      // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_411[0x7];                                      // 0x0411(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable_3;                              // 0x0428(0x00B8)()
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_____ID___ID;                              // 0x04F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0x4];                                      // 0x04F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_2;                      // 0x04F8(0x00B8)()
	int32                                         CallFunc_GetSummonerEntityId_ReturnValue;          // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B4[0x4];                                      // 0x05B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc_____ID_______;                            // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_____ID___________;                        // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x05C8(0x0028)(ZeroConstructor)
	class AActor*                                 CallFunc_____________1;                            // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F9[0x7];                                      // 0x05F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_609[0x3];                                      // 0x0609(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_____ID___ID_1;                            // 0x060C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_2;          // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable_4;                              // 0x0628(0x00B8)()
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x06E0(0x00B8)()
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x0798(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x07A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A1[0x7];                                      // 0x07A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x07A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x07B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7B1[0x7];                                      // 0x07B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue_1;         // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x07C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7C1[0x7];                                      // 0x07C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_EventManager_C*                     CallFunc________________;                          // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_CustomEvent___;                             // 0x07D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHitInformation                       K2Node_CustomEvent_____;                           // 0x07D8(0x0808)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0FE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0FE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0FE2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision) == 0x000008, "Wrong alignment on GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision");
static_assert(sizeof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision) == 0x000FE8, "Wrong size on GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, EntryPoint) == 0x000000, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc____________) == 0x000008, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CreateDelegate_OutputDelegate_3) == 0x000088, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CustomEvent_Tag) == 0x0000B0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, ___struct_Variable) == 0x0000E8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000F8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CustomEvent_Payload) == 0x000120, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, ___struct_Variable_1) == 0x0001D8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000290, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_IsValid_ReturnValue) == 0x000298, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CreateDelegate_OutputDelegate_6) == 0x0002A0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc__________) == 0x0002C8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc___________1) == 0x0002D0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc______________) == 0x0002D8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0002E0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_DynamicCast_AsTs_Base_Character) == 0x0002E8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_DynamicCast_bSuccess) == 0x0002F0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CreateDelegate_OutputDelegate_7) == 0x0002F8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000320, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc___________2) == 0x000328, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, ___struct_Variable_2) == 0x000330, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_GetDisplayName_ReturnValue) == 0x000340, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_GetObjectClass_ReturnValue) == 0x000350, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000358, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_____GA______________) == 0x000360, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CustomEvent_Tag_1) == 0x000370, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_Conv_NameToString_ReturnValue) == 0x000380, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CreateDelegate_OutputDelegate_8) == 0x000390, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc___________3) == 0x0003B8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_IsValid_ReturnValue_1) == 0x0003C0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CreateDelegate_OutputDelegate_9) == 0x0003C8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, ___bool_IsClosed_Variable) == 0x0003F0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc___________4) == 0x0003F8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_______________1) == 0x000400, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, ___bool_Has_Been_Initd_Variable) == 0x000401, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc__________SpeedRatio) == 0x000404, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000408, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_IsValid_ReturnValue_2) == 0x000410, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x000418, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_IsValid_ReturnValue_3) == 0x000420, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, ___struct_Variable_3) == 0x000428, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc___________5) == 0x0004E0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc___________6) == 0x0004E8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_____ID___ID) == 0x0004F0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_____ID___ID' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CustomEvent_Payload_2) == 0x0004F8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CustomEvent_Payload_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_GetSummonerEntityId_ReturnValue) == 0x0005B0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_GetSummonerEntityId_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_____ID_______) == 0x0005B8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_____ID_______' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_____ID___________) == 0x0005C0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_____ID___________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CreateDelegate_OutputDelegate_10) == 0x0005C8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_____________1) == 0x0005F0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_____________1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_IsValid_ReturnValue_4) == 0x0005F8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x000600, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_DynamicCast_bSuccess_1) == 0x000608, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_____ID___ID_1) == 0x00060C, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_____ID___ID_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc___________7) == 0x000610, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_WaitGameplayEvent_ReturnValue_2) == 0x000618, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_WaitGameplayEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_IsValid_ReturnValue_5) == 0x000620, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, ___struct_Variable_4) == 0x000628, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::___struct_Variable_4' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CustomEvent_Payload_1) == 0x0006E0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc___________8) == 0x000798, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_Event_bWasCancelled) == 0x0007A0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x0007A8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_IsValid_ReturnValue_6) == 0x0007B0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_WaitGameplayTagAdd_ReturnValue_1) == 0x0007B8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_WaitGameplayTagAdd_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_IsValid_ReturnValue_7) == 0x0007C0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc________________) == 0x0007C8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc________________' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CustomEvent___) == 0x0007D0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CustomEvent___' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, K2Node_CustomEvent_____) == 0x0007D8, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::K2Node_CustomEvent_____' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000FE0, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000FE1, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision, CallFunc_BooleanOR_ReturnValue) == 0x000FE2, "Member 'GA_Comboo_Vision_C_ExecuteUbergraph_GA_Comboo_Vision::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function GA_Comboo_Vision.GA_Comboo_Vision_C.Òr×û
// 0x0810 (0x0810 - 0x0000)
struct GA_Comboo_Vision_C__r__ final
{
public:
	class ATsBaseCharacter_C*                     _r;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSHitInformation                       __pn;                                              // 0x0008(0x0808)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(GA_Comboo_Vision_C__r__) == 0x000008, "Wrong alignment on GA_Comboo_Vision_C__r__");
static_assert(sizeof(GA_Comboo_Vision_C__r__) == 0x000810, "Wrong size on GA_Comboo_Vision_C__r__");
static_assert(offsetof(GA_Comboo_Vision_C__r__, _r) == 0x000000, "Member 'GA_Comboo_Vision_C__r__::_r' has a wrong offset!");
static_assert(offsetof(GA_Comboo_Vision_C__r__, __pn) == 0x000008, "Member 'GA_Comboo_Vision_C__r__::__pn' has a wrong offset!");

// Function GA_Comboo_Vision.GA_Comboo_Vision_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Comboo_Vision_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Comboo_Vision_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Comboo_Vision_C_K2_OnEndAbility");
static_assert(sizeof(GA_Comboo_Vision_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Comboo_Vision_C_K2_OnEndAbility");
static_assert(offsetof(GA_Comboo_Vision_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Comboo_Vision_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Comboo_Vision.GA_Comboo_Vision_C.EventReceived_18B59F5945020DB23C42FD88BD385F36
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88BD385F36 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88BD385F36) == 0x000008, "Wrong alignment on GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88BD385F36");
static_assert(sizeof(GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88BD385F36) == 0x0000B8, "Wrong size on GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88BD385F36");
static_assert(offsetof(GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88BD385F36, Payload) == 0x000000, "Member 'GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88BD385F36::Payload' has a wrong offset!");

// Function GA_Comboo_Vision.GA_Comboo_Vision_C.Added_21071CB943CD992BF8EFD6A39F485527
// 0x000C (0x000C - 0x0000)
struct GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A39F485527 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A39F485527) == 0x000004, "Wrong alignment on GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A39F485527");
static_assert(sizeof(GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A39F485527) == 0x00000C, "Wrong size on GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A39F485527");
static_assert(offsetof(GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A39F485527, Tag) == 0x000000, "Member 'GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A39F485527::Tag' has a wrong offset!");

// Function GA_Comboo_Vision.GA_Comboo_Vision_C.Added_21071CB943CD992BF8EFD6A3031ED77E
// 0x000C (0x000C - 0x0000)
struct GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A3031ED77E final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A3031ED77E) == 0x000004, "Wrong alignment on GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A3031ED77E");
static_assert(sizeof(GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A3031ED77E) == 0x00000C, "Wrong size on GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A3031ED77E");
static_assert(offsetof(GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A3031ED77E, Tag) == 0x000000, "Member 'GA_Comboo_Vision_C_Added_21071CB943CD992BF8EFD6A3031ED77E::Tag' has a wrong offset!");

// Function GA_Comboo_Vision.GA_Comboo_Vision_C.EventReceived_18B59F5945020DB23C42FD8807650D1C
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD8807650D1C final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD8807650D1C) == 0x000008, "Wrong alignment on GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD8807650D1C");
static_assert(sizeof(GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD8807650D1C) == 0x0000B8, "Wrong size on GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD8807650D1C");
static_assert(offsetof(GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD8807650D1C, Payload) == 0x000000, "Member 'GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD8807650D1C::Payload' has a wrong offset!");

// Function GA_Comboo_Vision.GA_Comboo_Vision_C.EventReceived_18B59F5945020DB23C42FD88D3AB825D
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88D3AB825D final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88D3AB825D) == 0x000008, "Wrong alignment on GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88D3AB825D");
static_assert(sizeof(GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88D3AB825D) == 0x0000B8, "Wrong size on GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88D3AB825D");
static_assert(offsetof(GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88D3AB825D, Payload) == 0x000000, "Member 'GA_Comboo_Vision_C_EventReceived_18B59F5945020DB23C42FD88D3AB825D::Payload' has a wrong offset!");

// Function GA_Comboo_Vision.GA_Comboo_Vision_C.>:©¶!‹
// 0x0001 (0x0001 - 0x0000)
struct GA_Comboo_Vision_C_______ final
{
public:
	bool                                          CallFunc_GetIsInGame_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Comboo_Vision_C_______) == 0x000001, "Wrong alignment on GA_Comboo_Vision_C_______");
static_assert(sizeof(GA_Comboo_Vision_C_______) == 0x000001, "Wrong size on GA_Comboo_Vision_C_______");
static_assert(offsetof(GA_Comboo_Vision_C_______, CallFunc_GetIsInGame_ReturnValue) == 0x000000, "Member 'GA_Comboo_Vision_C_______::CallFunc_GetIsInGame_ReturnValue' has a wrong offset!");

}

