#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Common_Paralysis_Camera

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_Common_Paralysis_Camera.GA_Common_Paralysis_Camera_C.ExecuteUbergraph_GA_Common_Paralysis_Camera
// 0x0208 (0x0208 - 0x0000)
struct GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0028)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue_1;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc____________;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc________ReturnValue;                       // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0068(0x0020)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0088(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRoleOnCameraRight_ReturnValue;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_____________1;                            // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRoleOnCameraRight_ReturnValue_1;        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_2;                          // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DotProduct2D_ReturnValue;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue;                      // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize2D_ReturnValue_1;                    // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x016C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_DegAcos_ReturnValue;                      // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsCameraTargetInScreen_ReturnValue;    // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0197(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc________;                                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x01B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x3];                                      // 0x01C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_________1;                                // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_____________2;                            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera) == 0x000008, "Wrong alignment on GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera");
static_assert(sizeof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera) == 0x000208, "Wrong size on GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, EntryPoint) == 0x000000, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc__________) == 0x000008, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_WaitDelay_ReturnValue) == 0x000010, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_WaitDelay_ReturnValue_1) == 0x000048, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_WaitDelay_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc___________1) == 0x000050, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc____________) == 0x000058, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc________ReturnValue) == 0x000060, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc________ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_IsValid_ReturnValue_1) == 0x000064, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_Less_FloatFloat_ReturnValue) == 0x000065, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x000068, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, K2Node_CreateDelegate_OutputDelegate_1) == 0x000088, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc___________2) == 0x0000B0, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0000B8, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_GetCameraLocation_ReturnValue) == 0x0000C0, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BreakVector_X) == 0x0000CC, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BreakVector_Y) == 0x0000D0, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BreakVector_Z) == 0x0000D4, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_IsRoleOnCameraRight_ReturnValue) == 0x0000D8, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_IsRoleOnCameraRight_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc___________3) == 0x0000E0, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E8, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_____________1) == 0x0000F8, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_____________1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BreakVector_X_1) == 0x000100, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BreakVector_Y_1) == 0x000104, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BreakVector_Z_1) == 0x000108, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00010C, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_IsRoleOnCameraRight_ReturnValue_1) == 0x000118, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_IsRoleOnCameraRight_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BreakVector_X_2) == 0x00011C, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BreakVector_Y_2) == 0x000120, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BreakVector_Z_2) == 0x000124, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000128, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00012C, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000130, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x000134, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_MakeVector2D_ReturnValue) == 0x000138, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_MakeVector2D_ReturnValue_1) == 0x000140, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_MakeVector2D_ReturnValue_2) == 0x000148, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_DotProduct2D_ReturnValue) == 0x000150, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_DotProduct2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_VSize2D_ReturnValue) == 0x000154, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_VSize2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_MakeVector2D_ReturnValue_3) == 0x000158, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x000160, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_VSize2D_ReturnValue_1) == 0x000168, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_VSize2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00016C, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000178, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BreakRotator_Roll) == 0x00017C, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BreakRotator_Pitch) == 0x000180, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BreakRotator_Yaw) == 0x000184, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000188, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00018C, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_DegAcos_ReturnValue) == 0x000190, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_DegAcos_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000194, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x000195, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_GetIsCameraTargetInScreen_ReturnValue) == 0x000196, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_GetIsCameraTargetInScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BooleanOR_ReturnValue) == 0x000197, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_BooleanOR_ReturnValue_1) == 0x000198, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc___________4) == 0x0001A0, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc________) == 0x0001A8, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc________' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0001B0, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x0001C0, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_________1) == 0x0001C4, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_________1' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc___________5) == 0x0001C8, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_____________2) == 0x0001D0, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_____________2' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc_IsValid_ReturnValue_2) == 0x0001D8, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc___________6) == 0x0001E0, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc___________7) == 0x0001E8, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc___________8) == 0x0001F0, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc___________9) == 0x0001F8, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera, CallFunc___________10) == 0x000200, "Member 'GA_Common_Paralysis_Camera_C_ExecuteUbergraph_GA_Common_Paralysis_Camera::CallFunc___________10' has a wrong offset!");

// Function GA_Common_Paralysis_Camera.GA_Common_Paralysis_Camera_C.¡—\4øù¹M
// 0x001C (0x001C - 0x0000)
struct GA_Common_Paralysis_Camera_C____4___M final
{
public:
	float                                         Stari_M;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _MLP;                                              // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _MLP_0;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __LP;                                              // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __LP_0;                                            // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _4Mn;                                              // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_1;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue_2;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Common_Paralysis_Camera_C____4___M) == 0x000004, "Wrong alignment on GA_Common_Paralysis_Camera_C____4___M");
static_assert(sizeof(GA_Common_Paralysis_Camera_C____4___M) == 0x00001C, "Wrong size on GA_Common_Paralysis_Camera_C____4___M");
static_assert(offsetof(GA_Common_Paralysis_Camera_C____4___M, Stari_M) == 0x000000, "Member 'GA_Common_Paralysis_Camera_C____4___M::Stari_M' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C____4___M, _MLP) == 0x000004, "Member 'GA_Common_Paralysis_Camera_C____4___M::_MLP' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C____4___M, _MLP_0) == 0x000008, "Member 'GA_Common_Paralysis_Camera_C____4___M::_MLP_0' has a wrong offset!");
static_assert(offsetof(GA_Common_Paralysis_Camera_C____4___M, __LP) == 0x00000C, "Member 'GA_Common_Paralysis_Camera_C____4___M::__LP' has a wrong offset!");
