#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Lingyang_AirAtt

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Lingyang_AirAtt.GA_Lingyang_AirAtt_C.ExecuteUbergraph_GA_Lingyang_AirAtt
// 0x0618 (0x0618 - 0x0000)
struct GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 CallFunc_WaitDelay_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayTag& Tag)>     K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0028)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_Tag;                            // 0x003C(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ___struct_Variable;                                // 0x0048(0x000C)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    CallFunc_WaitGameplayTagRemove_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0068(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0090(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B8(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00E0(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0108(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0130(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA______________;                     // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      CallFunc_WaitGameplayTagAdd_ReturnValue;           // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ___struct_Variable_1;                              // 0x0170(0x000C)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_Tag_1;                          // 0x0190(0x000C)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc__________;                                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayTag& Tag)>     K2Node_CreateDelegate_OutputDelegate_7;            // 0x01B0(0x0028)(ZeroConstructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x01E0(0x0028)(ZeroConstructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable_2;                              // 0x0230(0x00B8)()
	float                                         CallFunc__________SpeedRatio;                      // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0330(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________4;                              // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0390(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA_______________1;                   // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x03C8(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x03F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x0400(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________5;                              // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable_1;                       // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_______________2;                          // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable_1;                 // 0x0442(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_443[0x5];                                      // 0x0443(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________7;                              // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0450(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0460(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0468(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x0470(0x00B8)()
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0x7];                                      // 0x0531(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc____________;                              // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_IsHasInputDir_ReturnValue;                // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54A[0x6];                                      // 0x054A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________3;                          // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________12;                             // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_____________1;                            // 0x0569(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_56A[0x6];                                      // 0x056A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x0570(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________13;                             // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________14;                             // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc__________SpeedRatio_1;                    // 0x05B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________4;                          // 0x05B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B5[0x3];                                      // 0x05B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x05C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_____________2;                            // 0x05C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C2[0x6];                                      // 0x05C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________15;                             // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_____________3;                            // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_____________4;                            // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	uint8                                         Pad_5D2[0x6];                                      // 0x05D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________16;                             // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_________Id________;                       // 0x05E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHasInputDir_ReturnValue_1;              // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x05F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F2[0x6];                                      // 0x05F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________17;                             // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________18;                             // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsTag_ReturnValue_1;                // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHasInputDir_ReturnValue_2;              // 0x0609(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_____________5;                            // 0x060A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60B[0x5];                                      // 0x060B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________19;                             // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt) == 0x000008, "Wrong alignment on GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt");
static_assert(sizeof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt) == 0x000618, "Wrong size on GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, EntryPoint) == 0x000000, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_WaitDelay_ReturnValue) == 0x000008, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_WaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CustomEvent_Tag) == 0x00003C, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CustomEvent_Tag' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, ___struct_Variable) == 0x000048, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_WaitGameplayTagRemove_ReturnValue) == 0x000058, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_WaitGameplayTagRemove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_1) == 0x000068, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_2) == 0x000090, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B8, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000E0, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_5) == 0x000108, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_6) == 0x000130, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_____GA______________) == 0x000158, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_WaitGameplayTagAdd_ReturnValue) == 0x000168, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_WaitGameplayTagAdd_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, ___struct_Variable_1) == 0x000170, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_IsValid_ReturnValue_2) == 0x00017C, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_Conv_NameToString_ReturnValue) == 0x000180, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CustomEvent_Tag_1) == 0x000190, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CustomEvent_Tag_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc__________) == 0x0001A0, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_IsValid_ReturnValue_3) == 0x0001A8, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001B0, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, ___bool_IsClosed_Variable) == 0x0001D8, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001E0, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, ___bool_Has_Been_Initd_Variable) == 0x000208, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000210, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_WaitGameplayEvent_ReturnValue) == 0x000218, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_DynamicCast_AsTs_Base_Character) == 0x000220, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_DynamicCast_bSuccess) == 0x000228, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_IsValid_ReturnValue_4) == 0x000229, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, ___struct_Variable_2) == 0x000230, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc__________SpeedRatio) == 0x0002E8, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________1) == 0x0002F0, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc______________) == 0x0002F8, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________2) == 0x000300, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________3) == 0x000308, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_______________1) == 0x000310, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000318, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x000320, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_DynamicCast_bSuccess_1) == 0x000328, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00032C, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_9) == 0x000330, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________4) == 0x000358, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000360, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_GetDisplayName_ReturnValue) == 0x000368, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_IsValid_ReturnValue_5) == 0x000378, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_GetObjectClass_ReturnValue) == 0x000380, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000388, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_10) == 0x000390, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_____GA_______________1) == 0x0003B8, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_____GA_______________1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_11) == 0x0003C8, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0003F0, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_12) == 0x000400, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________5) == 0x000428, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_IsValid_ReturnValue_6) == 0x000430, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________6) == 0x000438, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, ___bool_IsClosed_Variable_1) == 0x000440, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::___bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_______________2) == 0x000441, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, ___bool_Has_Been_Initd_Variable_1) == 0x000442, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::___bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________7) == 0x000448, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_GetDisplayName_ReturnValue_1) == 0x000450, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_GetObjectClass_ReturnValue_1) == 0x000460, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000468, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CustomEvent_Payload) == 0x000470, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________8) == 0x000528, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_Event_bWasCancelled) == 0x000530, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________9) == 0x000538, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________10) == 0x000540, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc____________) == 0x000548, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc____________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_IsHasInputDir_ReturnValue) == 0x000549, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_IsHasInputDir_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________11) == 0x000550, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_______________3) == 0x000558, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_______________3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________12) == 0x000560, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________12' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_BooleanAND_ReturnValue) == 0x000568, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_____________1) == 0x000569, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_____________1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, K2Node_CreateDelegate_OutputDelegate_13) == 0x000570, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________13) == 0x000598, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________13' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_ContainsTag_ReturnValue) == 0x0005A0, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________14) == 0x0005A8, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________14' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc__________SpeedRatio_1) == 0x0005B0, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc__________SpeedRatio_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_______________4) == 0x0005B4, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_______________4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x0005B8, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_IsValid_ReturnValue_7) == 0x0005C0, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_____________2) == 0x0005C1, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_____________2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________15) == 0x0005C8, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________15' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_____________3) == 0x0005D0, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_____________3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_____________4) == 0x0005D1, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_____________4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________16) == 0x0005D8, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________16' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_________Id________) == 0x0005E0, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_________Id________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_IsHasInputDir_ReturnValue_1) == 0x0005F0, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_IsHasInputDir_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0005F1, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________17) == 0x0005F8, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________17' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________18) == 0x000600, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________18' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_ContainsTag_ReturnValue_1) == 0x000608, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_ContainsTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_IsHasInputDir_ReturnValue_2) == 0x000609, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_IsHasInputDir_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc_____________5) == 0x00060A, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc_____________5' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt, CallFunc___________19) == 0x000610, "Member 'GA_Lingyang_AirAtt_C_ExecuteUbergraph_GA_Lingyang_AirAtt::CallFunc___________19' has a wrong offset!");

// Function GA_Lingyang_AirAtt.GA_Lingyang_AirAtt_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Lingyang_AirAtt_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Lingyang_AirAtt_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_Lingyang_AirAtt_C_K2_OnEndAbility");
static_assert(sizeof(GA_Lingyang_AirAtt_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_Lingyang_AirAtt_C_K2_OnEndAbility");
static_assert(offsetof(GA_Lingyang_AirAtt_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_Lingyang_AirAtt_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_Lingyang_AirAtt.GA_Lingyang_AirAtt_C.Removed_3C76F9054844C591E103679CB9DDDBF8
// 0x000C (0x000C - 0x0000)
struct GA_Lingyang_AirAtt_C_Removed_3C76F9054844C591E103679CB9DDDBF8 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Lingyang_AirAtt_C_Removed_3C76F9054844C591E103679CB9DDDBF8) == 0x000004, "Wrong alignment on GA_Lingyang_AirAtt_C_Removed_3C76F9054844C591E103679CB9DDDBF8");
static_assert(sizeof(GA_Lingyang_AirAtt_C_Removed_3C76F9054844C591E103679CB9DDDBF8) == 0x00000C, "Wrong size on GA_Lingyang_AirAtt_C_Removed_3C76F9054844C591E103679CB9DDDBF8");
static_assert(offsetof(GA_Lingyang_AirAtt_C_Removed_3C76F9054844C591E103679CB9DDDBF8, Tag) == 0x000000, "Member 'GA_Lingyang_AirAtt_C_Removed_3C76F9054844C591E103679CB9DDDBF8::Tag' has a wrong offset!");

// Function GA_Lingyang_AirAtt.GA_Lingyang_AirAtt_C.Added_A5884BAD4906AA9E7EE3C5B977CE1FC3
// 0x000C (0x000C - 0x0000)
struct GA_Lingyang_AirAtt_C_Added_A5884BAD4906AA9E7EE3C5B977CE1FC3 final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Lingyang_AirAtt_C_Added_A5884BAD4906AA9E7EE3C5B977CE1FC3) == 0x000004, "Wrong alignment on GA_Lingyang_AirAtt_C_Added_A5884BAD4906AA9E7EE3C5B977CE1FC3");
static_assert(sizeof(GA_Lingyang_AirAtt_C_Added_A5884BAD4906AA9E7EE3C5B977CE1FC3) == 0x00000C, "Wrong size on GA_Lingyang_AirAtt_C_Added_A5884BAD4906AA9E7EE3C5B977CE1FC3");
static_assert(offsetof(GA_Lingyang_AirAtt_C_Added_A5884BAD4906AA9E7EE3C5B977CE1FC3, Tag) == 0x000000, "Member 'GA_Lingyang_AirAtt_C_Added_A5884BAD4906AA9E7EE3C5B977CE1FC3::Tag' has a wrong offset!");

// Function GA_Lingyang_AirAtt.GA_Lingyang_AirAtt_C.EventReceived_18B59F5945020DB23C42FD8810F9215E
// 0x00B8 (0x00B8 - 0x0000)
struct GA_Lingyang_AirAtt_C_EventReceived_18B59F5945020DB23C42FD8810F9215E final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_Lingyang_AirAtt_C_EventReceived_18B59F5945020DB23C42FD8810F9215E) == 0x000008, "Wrong alignment on GA_Lingyang_AirAtt_C_EventReceived_18B59F5945020DB23C42FD8810F9215E");
static_assert(sizeof(GA_Lingyang_AirAtt_C_EventReceived_18B59F5945020DB23C42FD8810F9215E) == 0x0000B8, "Wrong size on GA_Lingyang_AirAtt_C_EventReceived_18B59F5945020DB23C42FD8810F9215E");
static_assert(offsetof(GA_Lingyang_AirAtt_C_EventReceived_18B59F5945020DB23C42FD8810F9215E, Payload) == 0x000000, "Member 'GA_Lingyang_AirAtt_C_EventReceived_18B59F5945020DB23C42FD8810F9215E::Payload' has a wrong offset!");

// Function GA_Lingyang_AirAtt.GA_Lingyang_AirAtt_C.&yz
// 0x0018 (0x0018 - 0x0000)
struct GA_Lingyang_AirAtt_C__y____z final
{
public:
	bool                                          _z;                                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc___Current_______;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Lingyang_AirAtt_C__y____z) == 0x000008, "Wrong alignment on GA_Lingyang_AirAtt_C__y____z");
static_assert(sizeof(GA_Lingyang_AirAtt_C__y____z) == 0x000018, "Wrong size on GA_Lingyang_AirAtt_C__y____z");
static_assert(offsetof(GA_Lingyang_AirAtt_C__y____z, _z) == 0x000000, "Member 'GA_Lingyang_AirAtt_C__y____z::_z' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C__y____z, CallFunc__________) == 0x000008, "Member 'GA_Lingyang_AirAtt_C__y____z::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAtt_C__y____z, CallFunc___Current_______) == 0x000010, "Member 'GA_Lingyang_AirAtt_C__y____z::CallFunc___Current_______' has a wrong offset!");
