#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Lingyang_AirAttackPro

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Lingyang_AirAttackPro.GA_Lingyang_AirAttackPro_C.ExecuteUbergraph_GA_Lingyang_AirAttackPro
// 0x06C8 (0x06C8 - 0x0000)
struct GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0028)(ZeroConstructor)
	bool                                          CallFunc_ContainsTag_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0028)(ZeroConstructor)
	float                                         CallFunc__________SpeedRatio;                      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________2;                              // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00D8(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________4;                              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0140(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA______________;                     // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________5;                              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0190(0x0028)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio_1;                    // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________2;                          // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________7;                              // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________3;                          // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0200(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________9;                              // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0260(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA_______________1;                   // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0298(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x02D0(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________10;                             // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0308(0x0028)(ZeroConstructor)
	float                                         CallFunc__________SpeedRatio_2;                    // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________4;                          // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________12;                             // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________13;                             // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________5;                          // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_2; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_2;          // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x3];                                      // 0x0371(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________14;                             // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0388(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_399[0x7];                                      // 0x0399(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_2;             // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_2;      // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x03B0(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA_______________2;                   // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x03E8(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x0410(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0420(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________15;                             // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x3];                                      // 0x0451(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio_3;                    // 0x0454(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x0458(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________16;                             // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________6;                          // 0x0488(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________17;                             // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________18;                             // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________7;                          // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_3; // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_3;          // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_15;           // 0x04C0(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________19;                             // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_3; // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_3;             // 0x0500(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_3;             // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_3;      // 0x0520(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_521[0x7];                                      // 0x0521(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_16;           // 0x0528(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA_______________3;                   // 0x0550(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_3;          // 0x0560(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_17;           // 0x0570(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________20;                             // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x05A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A2[0x6];                                      // 0x05A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________21;                             // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_18;           // 0x05B0(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________22;                             // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________8;                          // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________23;                             // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x05F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0600(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________24;                             // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________25;                             // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_1;           // 0x0620(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x062C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x0638(0x0020)()
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self_CastInput; // 0x0658(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_669[0x7];                                      // 0x0669(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________26;                             // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Kuro_GetBlockActorWhenMove_ReturnValue;   // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0680(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       K2Node_DynamicCast_As_____actor;                   // 0x0688(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0690(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_691[0x3];                                      // 0x0691(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_19;           // 0x06A0(0x0028)(ZeroConstructor)
};
static_assert(alignof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro) == 0x000008, "Wrong alignment on GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro");
static_assert(sizeof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro) == 0x0006C8, "Wrong size on GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, EntryPoint) == 0x000000, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc__________) == 0x000008, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_ContainsTag_ReturnValue) == 0x000038, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_ContainsTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc__________SpeedRatio) == 0x000090, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000094, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________1) == 0x000098, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc______________) == 0x0000A0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________2) == 0x0000A8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________3) == 0x0000B0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_______________1) == 0x0000B8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0000C0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_DynamicCast_AsTs_Base_Character) == 0x0000C8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_DynamicCast_bSuccess) == 0x0000D0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000D8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000100, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________4) == 0x000108, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000110, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetDisplayName_ReturnValue) == 0x000118, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_IsValid_ReturnValue) == 0x000128, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetObjectClass_ReturnValue) == 0x000130, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000138, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_4) == 0x000140, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_____GA______________) == 0x000168, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_Conv_NameToString_ReturnValue) == 0x000178, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________5) == 0x000188, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_5) == 0x000190, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_IsValid_ReturnValue_1) == 0x0001B8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc__________SpeedRatio_1) == 0x0001BC, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc__________SpeedRatio_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________6) == 0x0001C0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_______________2) == 0x0001C8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________7) == 0x0001D0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________8) == 0x0001D8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_______________3) == 0x0001E0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_______________3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x0001E8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x0001F0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_DynamicCast_bSuccess_1) == 0x0001F8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0001FC, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_6) == 0x000200, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________9) == 0x000228, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000230, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetDisplayName_ReturnValue_1) == 0x000238, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_IsValid_ReturnValue_2) == 0x000248, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetObjectClass_ReturnValue_1) == 0x000250, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000258, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_7) == 0x000260, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_____GA_______________1) == 0x000288, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_____GA_______________1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_8) == 0x000298, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0002C0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_9) == 0x0002D0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________10) == 0x0002F8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_IsValid_ReturnValue_3) == 0x000300, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_10) == 0x000308, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc__________SpeedRatio_2) == 0x000330, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc__________SpeedRatio_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________11) == 0x000338, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_______________4) == 0x000340, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_______________4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________12) == 0x000348, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________12' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________13) == 0x000350, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________13' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_______________5) == 0x000358, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_______________5' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetOwningActorFromActorInfo_ReturnValue_2) == 0x000360, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetOwningActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_DynamicCast_AsTs_Base_Character_2) == 0x000368, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_DynamicCast_AsTs_Base_Character_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_DynamicCast_bSuccess_2) == 0x000370, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000374, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________14) == 0x000378, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________14' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2) == 0x000380, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetDisplayName_ReturnValue_2) == 0x000388, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_IsValid_ReturnValue_4) == 0x000398, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetObjectClass_ReturnValue_2) == 0x0003A0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetObjectClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_EqualEqual_ClassClass_ReturnValue_2) == 0x0003A8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_EqualEqual_ClassClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_11) == 0x0003B0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_____GA_______________2) == 0x0003D8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_____GA_______________2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_12) == 0x0003E8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_Conv_NameToString_ReturnValue_2) == 0x000410, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_Conv_NameToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_13) == 0x000420, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________15) == 0x000448, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________15' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_IsValid_ReturnValue_5) == 0x000450, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc__________SpeedRatio_3) == 0x000454, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc__________SpeedRatio_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_14) == 0x000458, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________16) == 0x000480, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________16' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_______________6) == 0x000488, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_______________6' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________17) == 0x000490, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________17' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________18) == 0x000498, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________18' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_______________7) == 0x0004A0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_______________7' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetOwningActorFromActorInfo_ReturnValue_3) == 0x0004A8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetOwningActorFromActorInfo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_DynamicCast_AsTs_Base_Character_3) == 0x0004B0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_DynamicCast_AsTs_Base_Character_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_DynamicCast_bSuccess_3) == 0x0004B8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_15) == 0x0004C0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x0004E8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________19) == 0x0004F0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________19' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_3) == 0x0004F8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetDisplayName_ReturnValue_3) == 0x000500, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetDisplayName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_IsValid_ReturnValue_6) == 0x000510, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetObjectClass_ReturnValue_3) == 0x000518, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetObjectClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_EqualEqual_ClassClass_ReturnValue_3) == 0x000520, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_EqualEqual_ClassClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_16) == 0x000528, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_____GA_______________3) == 0x000550, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_____GA_______________3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_Conv_NameToString_ReturnValue_3) == 0x000560, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_Conv_NameToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_17) == 0x000570, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________20) == 0x000598, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________20' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_IsValid_ReturnValue_7) == 0x0005A0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_Event_bWasCancelled) == 0x0005A1, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________21) == 0x0005A8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________21' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, K2Node_CreateDelegate_OutputDelegate_18) == 0x0005B0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________22) == 0x0005D8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________22' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_______________8) == 0x0005E0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_______________8' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________23) == 0x0005E8, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________23' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, ___bool_Has_Been_Initd_Variable) == 0x0005F0, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetActorUpVector_ReturnValue) == 0x0005F4, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000600, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________24) == 0x000610, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________24' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc___________25) == 0x000618, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc___________25' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_GetActorUpVector_ReturnValue_1) == 0x000620, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_GetActorUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x00062C, "Member 'GA_Lingyang_AirAttackPro_C_ExecuteUbergraph_GA_Lingyang_AirAttackPro::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
