#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Lingyang_AirAtt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Lingyang_AirAtt.GA_Lingyang_AirAtt_C
// 0x0010 (0x0540 - 0x0530)
class UGA_Lingyang_AirAtt_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Lingyang_AirAtt_C;               // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          ___S_S_;                                           // 0x0538(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ______;                                            // 0x0539(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_Lingyang_AirAtt(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnCompleted_5D118C384AE61F1C80292E8174246231();
	void OnBlendOut_5D118C384AE61F1C80292E8174246231();
	void OnInterrupted_5D118C384AE61F1C80292E8174246231();
	void OnCancelled_5D118C384AE61F1C80292E8174246231();
	void OnTick_5D118C384AE61F1C80292E8174246231();
	void Removed_3C76F9054844C591E103679CB9DDDBF8(const struct FGameplayTag& Tag);
	void OnFinish_6F79B83F41E1ACB9AF7BADB6C94D05E3();
	void Added_A5884BAD4906AA9E7EE3C5B977CE1FC3(const struct FGameplayTag& Tag);
	void OnCompleted_5D118C384AE61F1C80292E811E658C04();
	void OnBlendOut_5D118C384AE61F1C80292E811E658C04();
	void OnInterrupted_5D118C384AE61F1C80292E811E658C04();
	void OnCancelled_5D118C384AE61F1C80292E811E658C04();
	void OnTick_5D118C384AE61F1C80292E811E658C04();
	void EventReceived_18B59F5945020DB23C42FD8810F9215E(const struct FGameplayEventData& Payload);
	void ___MS_();
	void _y____z(bool* _z);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Lingyang_AirAtt_C">();
	}
	static class UGA_Lingyang_AirAtt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Lingyang_AirAtt_C>();
	}
};
static_assert(alignof(UGA_Lingyang_AirAtt_C) == 0x000008, "Wrong alignment on UGA_Lingyang_AirAtt_C");
static_assert(sizeof(UGA_Lingyang_AirAtt_C) == 0x000540, "Wrong size on UGA_Lingyang_AirAtt_C");
static_assert(offsetof(UGA_Lingyang_AirAtt_C, UberGraphFrame_GA_Lingyang_AirAtt_C) == 0x000530, "Member 'UGA_Lingyang_AirAtt_C::UberGraphFrame_GA_Lingyang_AirAtt_C' has a wrong offset!");
static_assert(offsetof(UGA_Lingyang_AirAtt_C, ___S_S_) == 0x000538, "Member 'UGA_Lingyang_AirAtt_C::___S_S_' has a wrong offset!");
static_assert(offsetof(UGA_Lingyang_AirAtt_C, ______) == 0x000539, "Member 'UGA_Lingyang_AirAtt_C::______' has a wrong offset!");

}

