#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Lingyang_AirDownAtt

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_Lingyang_AirDownAtt.GA_Lingyang_AirDownAtt_C.ExecuteUbergraph_GA_Lingyang_AirDownAtt
// 0x0640 (0x0640 - 0x0000)
struct GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________2;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0080(0x0028)(ZeroConstructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B8(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA______________;                     // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F0(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________3;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0138(0x0028)(ZeroConstructor)
	float                                         CallFunc__________SpeedRatio;                      // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________6;                              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________2;                          // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x01A8(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________7;                              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0210(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA_______________1;                   // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x0248(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0258(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________8;                              // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio_1;                    // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0290(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________3;                          // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________10;                             // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________11;                             // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________4;                          // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_2; // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_2;          // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x02F8(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________12;                             // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x0338(0x0028)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_2;             // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_2;      // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0388(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_____GA_______________2;                   // 0x03B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_2;          // 0x03C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________13;                             // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x03DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3DB[0x5];                                      // 0x03DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________14;                             // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable_1;                 // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_______________5;                          // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3EB[0x5];                                      // 0x03EB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x03F0(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________15;                             // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________16;                             // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________6;                          // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________17;                             // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0438(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable_1;                       // 0x0444(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_445[0x3];                                      // 0x0445(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0448(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________18;                             // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_1;           // 0x0460(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x0470(0x0028)(ZeroConstructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0498(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc____________________;                      // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A5[0x3];                                      // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio_2;                    // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2; // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________19;                             // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_CreateBulletFromGA_ReturnValue;           // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4CC[0x4];                                      // 0x04CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________20;                             // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_MakeLiteralGameplayTagContainer_ReturnValue; // 0x04D8(0x0020)()
	class ATsBaseCharacter_C*                     CallFunc___________21;                             // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_self_CastInput; // 0x0500(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x7];                                      // 0x0511(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Kuro_GetBlockActorWhenMove_ReturnValue;   // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       K2Node_DynamicCast_As_____actor;                   // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0528(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_529[0x3];                                      // 0x0529(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0530(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________22;                             // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_2;           // 0x0540(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________23;                             // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_2;       // 0x0558(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564[0x4];                                      // 0x0564(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________24;                             // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0571(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_572[0x2];                                      // 0x0572(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0574(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x057C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0588(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0594(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x05A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x05C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x05C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x05DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x05E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSelfOrParent_Result;                    // 0x05F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F5[0x3];                                      // 0x05F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_14;           // 0x05F8(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________25;                             // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue_3;           // 0x0628(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_3;       // 0x0634(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt) == 0x000008, "Wrong alignment on GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt");
static_assert(sizeof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt) == 0x000640, "Wrong size on GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, EntryPoint) == 0x000000, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000004, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc__________) == 0x000008, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________1) == 0x000010, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc______________) == 0x000018, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000020, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_DynamicCast_AsTs_Base_Character) == 0x000028, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000060, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________2) == 0x000068, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetDisplayName_ReturnValue) == 0x000070, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_1) == 0x000080, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetObjectClass_ReturnValue) == 0x0000A8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0000B0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_____GA______________) == 0x0000E0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_Conv_NameToString_ReturnValue) == 0x000118, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________3) == 0x000128, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_IsValid_ReturnValue) == 0x000130, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_4) == 0x000138, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc__________SpeedRatio) == 0x000160, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________4) == 0x000168, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_______________1) == 0x000170, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________5) == 0x000178, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________6) == 0x000180, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_______________2) == 0x000188, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000190, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x000198, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_DynamicCast_bSuccess_1) == 0x0001A0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001A8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0001D0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________7) == 0x0001D8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x0001E0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetDisplayName_ReturnValue_1) == 0x0001E8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_IsValid_ReturnValue_1) == 0x0001F8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetObjectClass_ReturnValue_1) == 0x000200, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000208, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_6) == 0x000210, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_____GA_______________1) == 0x000238, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_____GA_______________1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_Conv_NameToString_ReturnValue_1) == 0x000248, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_7) == 0x000258, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________8) == 0x000280, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_IsValid_ReturnValue_2) == 0x000288, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc__________SpeedRatio_1) == 0x00028C, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc__________SpeedRatio_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_8) == 0x000290, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________9) == 0x0002B8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_______________3) == 0x0002C0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_______________3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________10) == 0x0002C8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________10' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________11) == 0x0002D0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________11' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_______________4) == 0x0002D8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_______________4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetOwningActorFromActorInfo_ReturnValue_2) == 0x0002E0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetOwningActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_DynamicCast_AsTs_Base_Character_2) == 0x0002E8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_DynamicCast_AsTs_Base_Character_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_DynamicCast_bSuccess_2) == 0x0002F0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_9) == 0x0002F8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000320, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________12) == 0x000328, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________12' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000330, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_10) == 0x000338, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_IsValid_ReturnValue_3) == 0x000360, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetDisplayName_ReturnValue_2) == 0x000368, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetObjectClass_ReturnValue_2) == 0x000378, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetObjectClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_EqualEqual_ClassClass_ReturnValue_2) == 0x000380, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_EqualEqual_ClassClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_11) == 0x000388, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_____GA_______________2) == 0x0003B0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_____GA_______________2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_Conv_NameToString_ReturnValue_2) == 0x0003C0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_Conv_NameToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________13) == 0x0003D0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________13' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_IsValid_ReturnValue_4) == 0x0003D8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, ___bool_IsClosed_Variable) == 0x0003D9, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, ___bool_Has_Been_Initd_Variable) == 0x0003DA, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________14) == 0x0003E0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________14' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, ___bool_Has_Been_Initd_Variable_1) == 0x0003E8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::___bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_______________5) == 0x0003E9, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_______________5' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_Event_bWasCancelled) == 0x0003EA, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_12) == 0x0003F0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________15) == 0x000418, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________15' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________16) == 0x000420, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________16' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_______________6) == 0x000428, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_______________6' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________17) == 0x000430, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________17' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetActorUpVector_ReturnValue) == 0x000438, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, ___bool_IsClosed_Variable_1) == 0x000444, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::___bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000448, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________18) == 0x000458, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________18' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetActorUpVector_ReturnValue_1) == 0x000460, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetActorUpVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_CreateDelegate_OutputDelegate_13) == 0x000470, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000498, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc____________________) == 0x0004A4, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc____________________' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc__________SpeedRatio_2) == 0x0004A8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc__________SpeedRatio_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2) == 0x0004B0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_IsValid_ReturnValue_5) == 0x0004B8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________19) == 0x0004C0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________19' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_CreateBulletFromGA_ReturnValue) == 0x0004C8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_CreateBulletFromGA_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________20) == 0x0004D0, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________20' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_MakeLiteralGameplayTagContainer_ReturnValue) == 0x0004D8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_MakeLiteralGameplayTagContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________21) == 0x0004F8, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________21' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_HasAllMatchingGameplayTags_self_CastInput) == 0x000500, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_HasAllMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_HasAllMatchingGameplayTags_ReturnValue) == 0x000510, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_HasAllMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_Kuro_GetBlockActorWhenMove_ReturnValue) == 0x000518, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_Kuro_GetBlockActorWhenMove_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_DynamicCast_As_____actor) == 0x000520, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_DynamicCast_As_____actor' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, K2Node_DynamicCast_bSuccess_3) == 0x000528, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x00052C, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_Add_FloatFloat_ReturnValue) == 0x000530, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________22) == 0x000538, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________22' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_GetActorUpVector_ReturnValue_2) == 0x000540, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_GetActorUpVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________23) == 0x000550, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________23' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_Multiply_VectorFloat_ReturnValue_2) == 0x000558, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_Multiply_VectorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc___________24) == 0x000568, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc___________24' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_BreakHitResult_bBlockingHit) == 0x000570, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_BreakHitResult_bInitialOverlap) == 0x000571, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_BreakHitResult_Time) == 0x000574, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_BreakHitResult_Distance) == 0x000578, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_BreakHitResult_Location) == 0x00057C, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_BreakHitResult_ImpactPoint) == 0x000588, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt, CallFunc_BreakHitResult_Normal) == 0x000594, "Member 'GA_Lingyang_AirDownAtt_C_ExecuteUbergraph_GA_Lingyang_AirDownAtt::CallFunc_BreakHitResult_Normal' has a wrong offset!");
