#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_MO1LiufangzhemanMd00001_Attack02

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_MO1LiufangzhemanMd00001_Attack02.GA_MO1LiufangzhemanMd00001_Attack02_C.ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02
// 0x0648 (0x0648 - 0x0000)
struct GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable;                                // 0x0008(0x00B8)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue;            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0100(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0128(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0150(0x0028)(ZeroConstructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0178(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc__________;                                // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc______________;                            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_Payload;                        // 0x01C8(0x00B8)()
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0280(0x0028)(ZeroConstructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc___________1;                              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         CallFunc_WaitGameplayEvent_ReturnValue_1;          // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x02C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     ___struct_Variable_1;                              // 0x02E8(0x00B8)()
	struct FGameplayEventData                     K2Node_CustomEvent_Payload_1;                      // 0x03A0(0x00B8)()
	class FString                                 CallFunc_____GA______________;                     // 0x0458(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0468(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayEventData& Payload)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0478(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________2;                              // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x3];                                      // 0x04A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc__________SpeedRatio;                      // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x04B0(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________3;                              // 0x04D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________1;                          // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________4;                              // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     CallFunc___________5;                              // 0x04F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________2;                          // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F9[0x7];                                      // 0x04F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0500(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     K2Node_DynamicCast_AsTs_Base_Character_1;          // 0x0508(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0510(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_511[0x3];                                      // 0x0511(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0514(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc___________6;                              // 0x0518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue; // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0528(0x0028)(ZeroConstructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_551[0x7];                                      // 0x0551(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_____GA_______________1;                   // 0x0578(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0588(0x0028)(ZeroConstructor)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x05B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x05C0(0x0028)(ZeroConstructor)
	class UAnimMontage*                           CallFunc___________7;                              // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F1[0x7];                                      // 0x05F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ATsBaseCharacter_C*                     CallFunc___________8;                              // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0600(0x0028)(ZeroConstructor)
	class ATsBaseCharacter_C*                     CallFunc___________9;                              // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc__________SpeedRatio_1;                    // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_______________3;                          // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_635[0x3];                                      // 0x0635(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_PlayMontageAndWait*        CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1; // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02) == 0x000008, "Wrong alignment on GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02");
static_assert(sizeof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02) == 0x000648, "Wrong size on GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, EntryPoint) == 0x000000, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, ___struct_Variable) == 0x000008, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_Not_PreBool_ReturnValue) == 0x0000C0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_WaitGameplayEvent_ReturnValue) == 0x0000C8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_WaitGameplayEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CreateDelegate_OutputDelegate) == 0x0000D8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CreateDelegate_OutputDelegate_1) == 0x000100, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CreateDelegate_OutputDelegate_2) == 0x000128, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CreateDelegate_OutputDelegate_3) == 0x000150, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CreateDelegate_OutputDelegate_4) == 0x000178, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc__________) == 0x0001A0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc__________' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x0001A8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc______________) == 0x0001B0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc______________' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_DynamicCast_AsTs_Base_Character) == 0x0001B8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_DynamicCast_AsTs_Base_Character' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CustomEvent_Payload) == 0x0001C8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CustomEvent_Payload' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CreateDelegate_OutputDelegate_5) == 0x000280, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0002A8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc___________1) == 0x0002B0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_WaitGameplayEvent_ReturnValue_1) == 0x0002B8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_WaitGameplayEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_GetDisplayName_ReturnValue) == 0x0002C0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_IsValid_ReturnValue_1) == 0x0002D0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_GetObjectClass_ReturnValue) == 0x0002D8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0002E0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, ___struct_Variable_1) == 0x0002E8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CustomEvent_Payload_1) == 0x0003A0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CustomEvent_Payload_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_____GA______________) == 0x000458, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_____GA______________' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_Conv_NameToString_ReturnValue) == 0x000468, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CreateDelegate_OutputDelegate_6) == 0x000478, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc___________2) == 0x0004A0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc___________2' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_IsValid_ReturnValue_2) == 0x0004A8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc__________SpeedRatio) == 0x0004AC, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc__________SpeedRatio' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CreateDelegate_OutputDelegate_7) == 0x0004B0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc___________3) == 0x0004D8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc___________3' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_______________1) == 0x0004E0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_______________1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc___________4) == 0x0004E8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc___________4' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc___________5) == 0x0004F0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc___________5' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_______________2) == 0x0004F8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_______________2' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000500, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_DynamicCast_AsTs_Base_Character_1) == 0x000508, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_DynamicCast_AsTs_Base_Character_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_DynamicCast_bSuccess_1) == 0x000510, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000514, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc___________6) == 0x000518, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc___________6' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue) == 0x000520, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CreateDelegate_OutputDelegate_8) == 0x000528, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_IsValid_ReturnValue_3) == 0x000550, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_GetDisplayName_ReturnValue_1) == 0x000558, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_GetObjectClass_ReturnValue_1) == 0x000568, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000570, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_____GA_______________1) == 0x000578, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_____GA_______________1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CreateDelegate_OutputDelegate_9) == 0x000588, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0005B0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CreateDelegate_OutputDelegate_10) == 0x0005C0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc___________7) == 0x0005E8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc___________7' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_IsValid_ReturnValue_4) == 0x0005F0, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc___________8) == 0x0005F8, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc___________8' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, K2Node_CreateDelegate_OutputDelegate_11) == 0x000600, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc___________9) == 0x000628, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc___________9' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc__________SpeedRatio_1) == 0x000630, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc__________SpeedRatio_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_______________3) == 0x000634, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_______________3' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1) == 0x000638, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_CreatePlayMontageAndWaitProxy_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02, CallFunc_IsValid_ReturnValue_5) == 0x000640, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_ExecuteUbergraph_GA_MO1LiufangzhemanMd00001_Attack02::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function GA_MO1LiufangzhemanMd00001_Attack02.GA_MO1LiufangzhemanMd00001_Attack02_C.EventReceived_18B59F5945020DB23C42FD88B3349666
// 0x00B8 (0x00B8 - 0x0000)
struct GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD88B3349666 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD88B3349666) == 0x000008, "Wrong alignment on GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD88B3349666");
static_assert(sizeof(GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD88B3349666) == 0x0000B8, "Wrong size on GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD88B3349666");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD88B3349666, Payload) == 0x000000, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD88B3349666::Payload' has a wrong offset!");

// Function GA_MO1LiufangzhemanMd00001_Attack02.GA_MO1LiufangzhemanMd00001_Attack02_C.EventReceived_18B59F5945020DB23C42FD8809140418
// 0x00B8 (0x00B8 - 0x0000)
struct GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD8809140418 final
{
public:
	struct FGameplayEventData                     Payload;                                           // 0x0000(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD8809140418) == 0x000008, "Wrong alignment on GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD8809140418");
static_assert(sizeof(GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD8809140418) == 0x0000B8, "Wrong size on GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD8809140418");
static_assert(offsetof(GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD8809140418, Payload) == 0x000000, "Member 'GA_MO1LiufangzhemanMd00001_Attack02_C_EventReceived_18B59F5945020DB23C42FD8809140418::Payload' has a wrong offset!");

}

