#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Role_Suiguang_FixHook

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_Base_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Role_Suiguang_FixHook.GA_Role_Suiguang_FixHook_C
// 0x0058 (0x0588 - 0x0530)
class UGA_Role_Suiguang_FixHook_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Role_Suiguang_FixHook_C;         // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ATsBaseCharacter_C*                     ____0;                                             // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FixHookLocation;                                   // 0x0540(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                U___;                                              // 0x054C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BlockTime;                                         // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _r__SJ_;                                           // 0x055C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastDirect;                                        // 0x0560(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSuiGuangType;                                    // 0x056C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56D[0x3];                                      // 0x056D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 FixHookActor;                                      // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FixHookLocation_NUpdate;                           // 0x0578(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Role_Suiguang_FixHook(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void MovementModeChange(class ACharacter* Character, EMovementMode PrevMovementMode, uint8 PreviousCustomMode);
	void OnTick_AD5ADDBF47997B989A9016A78CAC22E7();
	void OnFinish_AD5ADDBF47997B989A9016A78CAC22E7();
	void FixHookStart();
	void FixHookTick();
	void _____();
	void RefreshFixHookLocation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Role_Suiguang_FixHook_C">();
	}
	static class UGA_Role_Suiguang_FixHook_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Role_Suiguang_FixHook_C>();
	}
};
static_assert(alignof(UGA_Role_Suiguang_FixHook_C) == 0x000008, "Wrong alignment on UGA_Role_Suiguang_FixHook_C");
static_assert(sizeof(UGA_Role_Suiguang_FixHook_C) == 0x000588, "Wrong size on UGA_Role_Suiguang_FixHook_C");
static_assert(offsetof(UGA_Role_Suiguang_FixHook_C, UberGraphFrame_GA_Role_Suiguang_FixHook_C) == 0x000530, "Member 'UGA_Role_Suiguang_FixHook_C::UberGraphFrame_GA_Role_Suiguang_FixHook_C' has a wrong offset!");
static_assert(offsetof(UGA_Role_Suiguang_FixHook_C, ____0) == 0x000538, "Member 'UGA_Role_Suiguang_FixHook_C::____0' has a wrong offset!");
static_assert(offsetof(UGA_Role_Suiguang_FixHook_C, FixHookLocation) == 0x000540, "Member 'UGA_Role_Suiguang_FixHook_C::FixHookLocation' has a wrong offset!");
static_assert(offsetof(UGA_Role_Suiguang_FixHook_C, U___) == 0x00054C, "Member 'UGA_Role_Suiguang_FixHook_C::U___' has a wrong offset!");
static_assert(offsetof(UGA_Role_Suiguang_FixHook_C, BlockTime) == 0x000558, "Member 'UGA_Role_Suiguang_FixHook_C::BlockTime' has a wrong offset!");
static_assert(offsetof(UGA_Role_Suiguang_FixHook_C, _r__SJ_) == 0x00055C, "Member 'UGA_Role_Suiguang_FixHook_C::_r__SJ_' has a wrong offset!");
static_assert(offsetof(UGA_Role_Suiguang_FixHook_C, LastDirect) == 0x000560, "Member 'UGA_Role_Suiguang_FixHook_C::LastDirect' has a wrong offset!");
static_assert(offsetof(UGA_Role_Suiguang_FixHook_C, IsSuiGuangType) == 0x00056C, "Member 'UGA_Role_Suiguang_FixHook_C::IsSuiGuangType' has a wrong offset!");
static_assert(offsetof(UGA_Role_Suiguang_FixHook_C, FixHookActor) == 0x000570, "Member 'UGA_Role_Suiguang_FixHook_C::FixHookActor' has a wrong offset!");
static_assert(offsetof(UGA_Role_Suiguang_FixHook_C, FixHookLocation_NUpdate) == 0x000578, "Member 'UGA_Role_Suiguang_FixHook_C::FixHookLocation_NUpdate' has a wrong offset!");

}

