#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Vision_ShowTime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SVisionData_structs.hpp"
#include "GA_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Vision_ShowTime.GA_Vision_ShowTime_C
// 0x0158 (0x0688 - 0x0530)
class UGA_Vision_ShowTime_C final : public UGA_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Vision_ShowTime_C;               // 0x0530(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityTask_WaitDelay*                 Async_Task;                                        // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                _____P_yH;                                         // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ______PyH;                                         // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_BaseVision_C*                       _aBP;                                              // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     __BP;                                              // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSVisionData                           _apn;                                              // 0x0560(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
	class UAbilityTask_WaitDelay*                 _e_____P_;                                         // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                _____P_yH_0;                                       // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __P_;                                              // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         P_Handle;                                          // 0x0668(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66C[0x4];                                      // 0x066C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                _____P_yH_1;                                       // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          _;                                                 // 0x0678(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_679[0x3];                                      // 0x0679(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         _______;                                           // 0x067C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATsBaseCharacter_C*                     ___a;                                              // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Vision_ShowTime(int32 EntryPoint);
	void P___(int32 P_ID);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void _______4();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Vision_ShowTime_C">();
	}
	static class UGA_Vision_ShowTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Vision_ShowTime_C>();
	}
};
static_assert(alignof(UGA_Vision_ShowTime_C) == 0x000008, "Wrong alignment on UGA_Vision_ShowTime_C");
static_assert(sizeof(UGA_Vision_ShowTime_C) == 0x000688, "Wrong size on UGA_Vision_ShowTime_C");
static_assert(offsetof(UGA_Vision_ShowTime_C, UberGraphFrame_GA_Vision_ShowTime_C) == 0x000530, "Member 'UGA_Vision_ShowTime_C::UberGraphFrame_GA_Vision_ShowTime_C' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, Async_Task) == 0x000538, "Member 'UGA_Vision_ShowTime_C::Async_Task' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, _____P_yH) == 0x000540, "Member 'UGA_Vision_ShowTime_C::_____P_yH' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, ______PyH) == 0x000548, "Member 'UGA_Vision_ShowTime_C::______PyH' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, _aBP) == 0x000550, "Member 'UGA_Vision_ShowTime_C::_aBP' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, __BP) == 0x000558, "Member 'UGA_Vision_ShowTime_C::__BP' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, _apn) == 0x000560, "Member 'UGA_Vision_ShowTime_C::_apn' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, _e_____P_) == 0x000650, "Member 'UGA_Vision_ShowTime_C::_e_____P_' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, _____P_yH_0) == 0x000658, "Member 'UGA_Vision_ShowTime_C::_____P_yH_0' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, __P_) == 0x000660, "Member 'UGA_Vision_ShowTime_C::__P_' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, P_Handle) == 0x000668, "Member 'UGA_Vision_ShowTime_C::P_Handle' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, _____P_yH_1) == 0x000670, "Member 'UGA_Vision_ShowTime_C::_____P_yH_1' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, _) == 0x000678, "Member 'UGA_Vision_ShowTime_C::_' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, _______) == 0x00067C, "Member 'UGA_Vision_ShowTime_C::_______' has a wrong offset!");
static_assert(offsetof(UGA_Vision_ShowTime_C, ___a) == 0x000680, "Member 'UGA_Vision_ShowTime_C::___a' has a wrong offset!");

}

