#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TsAiController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ECharacterState_structs.hpp"
#include "KuroGameplay_classes.hpp"


namespace SDK
{

// TypeScriptGeneratedClass TsAiController.TsAiController_C
// 0x0020 (0x03D8 - 0x03B8)
class ATsAiController_C : public AKuroAIController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBehaviorTree*                          BehaviorTree;                                      // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DebugDraw;                                         // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3CC[0x4];                                      // 0x03CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKuroStateMachineGroup*                 StateMachineGroup;                                 // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void AicApplyBuffToTarget(int32 TargetId, int64 buffId);
	void ChangeDebugDraw();
	void GetDebugStateMachine(TArray<class FText>& Output);
	void _b_____(TArray<class FString>& States);
	bool _______(TArray<class FString>& States);
	void ___b_(ECharacterState OldState, ECharacterState NewState, bool Param_IsAutonomousProxy);
	void ___6C_();
	bool ____();
	bool _____0();
	void StartCooldownTimer(int32 Id, float Duration);
	void InitCooldownEvent(int32 Id, class UKuroBooleanEventBinder* EventBinder);
	void SetCoolDown(int32 Id, float Cd);
	float GetCoolDownRemainTime(int32 Id);
	bool GetCoolDownDone(int32 Id);
	void SetAiAlertConfig(const class FString& ConfigId);
	void AddAlertEventBinder(class UKuroBooleanEventBinder* EventBinder);
	void SetAiHateConfig(const class FString& ConfigId);
	void AddSceneItemDestroyEventBinder(float Distance, class UKuroActorEventBinder* EventBinder);
	void SetPerceptionEventState(bool IncludeFriend, bool IncludeEnemy, bool IncludeNeutral);
	void AddHateOutRangeEventBinder(class UKuroPerceptionEventBinder* Handler);
	void AddPerceptionEventBinder(class UKuroPerceptionEventBinder* Handler);
	void AddHateEventBinder(class UKuroPerceptionEventBinder* Handler1);
	void EnableAiSenseByType(int32 Type, bool Enable);
	void AddOrRemoveAiSense(int32 AiSenseId, bool Add);
	void SetAiSenseEnable(int32 Param_Index, bool Enable);
	void LogReport(int32 LogId);
	void SetAiEnable(bool Enable, const class FString& Key);
	void AicRemoveTag(const struct FGameplayTag& Tag);
	void AicAddTag(const struct FGameplayTag& Tag);
	void AicRemoveBuff(int64 buffId);
	void AicApplyBuff(int64 buffId);
	void TestChangeAi(const class FString& Id);
	void AddBattleWanderEndTime(float AddTime);
	void SetBattleWanderIndex(int32 Param_Index);
	void ClearHatred(int32 EntityId);
	void ChangeHatred(int32 EntityId, float Rate, float Abs);
	class FText GetDebugText();
	void OnStart();
	void AddComplicatedEventBinder(const struct FSAiConditions& Conditions, class UKuroBooleanEventBinder* EventBinder);
	void SetBattleWanderTime(float Min, float Max);
	void AddSkillCd(int32 SkillInfoId, float CdAdd);
	void ActivateSkillGroup(int32 SkillGroupIndex, bool Activate);
	void ReceiveDestroyed();
	void ExecuteUbergraph_TsAiController(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TsAiController_C">();
	}
	static class ATsAiController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATsAiController_C>();
	}
};
static_assert(alignof(ATsAiController_C) == 0x000008, "Wrong alignment on ATsAiController_C");
static_assert(sizeof(ATsAiController_C) == 0x0003D8, "Wrong size on ATsAiController_C");
static_assert(offsetof(ATsAiController_C, UberGraphFrame) == 0x0003B8, "Member 'ATsAiController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATsAiController_C, BehaviorTree) == 0x0003C0, "Member 'ATsAiController_C::BehaviorTree' has a wrong offset!");
static_assert(offsetof(ATsAiController_C, DebugDraw) == 0x0003C8, "Member 'ATsAiController_C::DebugDraw' has a wrong offset!");
static_assert(offsetof(ATsAiController_C, StateMachineGroup) == 0x0003D0, "Member 'ATsAiController_C::StateMachineGroup' has a wrong offset!");

}

